{-# LANGUAGE OverloadedStrings #-}

module QxFx0.Semantic.Input.GeneratedLexicon
  ( generatedFormToLemma
  , generatedLemmaToPos
  , generatedLemmaToSem
  ) where

import Data.Text (Text)
import QxFx0.Semantic.Input.Model (InputPartOfSpeech(..), InputSemanticClass(..))

generatedFormToLemma :: Text -> Maybe Text
generatedFormToLemma t = case t of
    "абстрактное" -> Just "абстрактное"
    "автоматически" -> Just "автоматически"
    "автором" -> Just "автором"
    "ага" -> Just "ага"
    "адресат" -> Just "адресат"
    "алло" -> Just "алло"
    "анализ" -> Just "анализ"
    "анализа" -> Just "анализа"
    "ах" -> Just "ах"
    "базового" -> Just "базового"
    "базовые" -> Just "базовые"
    "бах" -> Just "бах"
    "безличная" -> Just "безличная"
    "безличное" -> Just "безличное"
    "белый" -> Just "белый"
    "билет" -> Just "билет"
    "благодаря" -> Just "благодаря"
    "блоки" -> Just "блоки"
    "более" -> Just "более"
    "больной" -> Just "больной"
    "больше" -> Just "больше"
    "большой" -> Just "большой"
    "бот" -> Just "бот"
    "боюсь" -> Just "боюсь"
    "брат" -> Just "брат"
    "брата" -> Just "брата"
    "будет" -> Just "быть"
    "будто" -> Just "будто"
    "буду" -> Just "буду"
    "будущее" -> Just "будущее"
    "бывает" -> Just "бывает"
    "бык" -> Just "бык"
    "был" -> Just "быть"
    "была" -> Just "быть"
    "было" -> Just "было"
    "быстрее" -> Just "быстрее"
    "быстро" -> Just "быстро"
    "быть" -> Just "быть"
    "важен" -> Just "важен"
    "важнее" -> Just "важнее"
    "важно" -> Just "важно"
    "важны" -> Just "важны"
    "валентность" -> Just "валентность"
    "вам" -> Just "вы"
    "вами" -> Just "вы"
    "вариант" -> Just "вариант"
    "вас" -> Just "вы"
    "ввода" -> Just "ввода"
    "вводит" -> Just "вводит"
    "вводное" -> Just "вводное"
    "ведь" -> Just "ведь"
    "вера" -> Just "вера"
    "верно" -> Just "верно"
    "вернуть" -> Just "вернуть"
    "вероятен" -> Just "вероятен"
    "вероятно" -> Just "вероятно"
    "вероятность" -> Just "вероятность"
    "весь" -> Just "весь"
    "вечером" -> Just "вечером"
    "вид" -> Just "вид"
    "видел" -> Just "видел"
    "виду" -> Just "виду"
    "вижу" -> Just "вижу"
    "вин" -> Just "вин"
    "винительный" -> Just "винительный"
    "включает" -> Just "включает"
    "включая" -> Just "включая"
    "влияет" -> Just "влияет"
    "вместо" -> Just "вместо"
    "внутри" -> Just "внутри"
    "во-первых" -> Just "во-первых"
    "вовремя" -> Just "вовремя"
    "вода" -> Just "вода"
    "воды" -> Just "воды"
    "возвратность" -> Just "возвратность"
    "возвращать" -> Just "возвращать"
    "возможно" -> Just "возможно"
    "возможность" -> Just "возможность"
    "возможные" -> Just "возможные"
    "войти" -> Just "войти"
    "вон" -> Just "вон"
    "вообще" -> Just "вообще"
    "вопрос" -> Just "вопрос"
    "вопроса" -> Just "вопроса"
    "вопросительная" -> Just "вопросительная"
    "вопросительное" -> Just "вопросительное"
    "вопросительность" -> Just "вопросительность"
    "вопросительные" -> Just "вопросительные"
    "вопросительный" -> Just "вопросительный"
    "вопросом" -> Just "вопросом"
    "вопросы" -> Just "вопросы"
    "вошел" -> Just "вошел"
    "впрочем" -> Just "впрочем"
    "врач" -> Just "врач"
    "вредно" -> Just "вредно"
    "времени" -> Just "времени"
    "временная" -> Just "временная"
    "время" -> Just "время"
    "вряд" -> Just "вряд"
    "все" -> Just "все"
    "все-таки" -> Just "все-таки"
    "всегда" -> Just "всегда"
    "всего" -> Just "всего"
    "всех" -> Just "всех"
    "вследствие" -> Just "вследствие"
    "второй" -> Just "второй"
    "входит" -> Just "входит"
    "входить" -> Just "входить"
    "вчера" -> Just "вчера"
    "вы" -> Just "вы"
    "выбирать" -> Just "выбирать"
    "выбрать" -> Just "выбрать"
    "вывод" -> Just "вывод"
    "выделять" -> Just "выделять"
    "выполнить" -> Just "выполнить"
    "выполнять" -> Just "выполнять"
    "выражает" -> Just "выражает"
    "выражается" -> Just "выражается"
    "выражения" -> Just "выражения"
    "высказывание" -> Just "высказывание"
    "высказывания" -> Just "высказывания"
    "высокий" -> Just "высокий"
    "выше" -> Just "выше"
    "где" -> Just "где"
    "генерации" -> Just "генерации"
    "генерация" -> Just "генерация"
    "главная" -> Just "главная"
    "главное" -> Just "главное"
    "главные" -> Just "главные"
    "главный" -> Just "главный"
    "глагол" -> Just "глагол"
    "глагола" -> Just "глагола"
    "глаголом" -> Just "глаголом"
    "глаголы" -> Just "глаголы"
    "глагольное" -> Just "глагольное"
    "глагольные" -> Just "глагольные"
    "говори" -> Just "говори"
    "говорил" -> Just "говорил"
    "говорить" -> Just "говорить"
    "говоря" -> Just "говоря"
    "говорящего" -> Just "говорящего"
    "голубая" -> Just "голубой"
    "голубого" -> Just "голубой"
    "голубое" -> Just "голубой"
    "голубой" -> Just "голубой"
    "голубому" -> Just "голубой"
    "голубые" -> Just "голубой"
    "город" -> Just "город"
    "готов" -> Just "готов"
    "готова" -> Just "готова"
    "готово" -> Just "готово"
    "грамматике" -> Just "грамматике"
    "грамматику" -> Just "грамматику"
    "грамматически" -> Just "грамматически"
    "грамматический" -> Just "грамматический"
    "громко" -> Just "громко"
    "громкое" -> Just "громкое"
    "группа" -> Just "группа"
    "группу" -> Just "группу"
    "группы" -> Just "группы"
    "грустно" -> Just "грустно"
    "да" -> Just "да"
    "давай" -> Just "давай"
    "дай" -> Just "дай"
    "данных" -> Just "данных"
    "дат" -> Just "дат"
    "дательный" -> Just "дательный"
    "дают" -> Just "дают"
    "два" -> Just "два"
    "двадцать" -> Just "двадцать"
    "дверь" -> Just "дверь"
    "движения" -> Just "движения"
    "двое" -> Just "двое"
    "деепричастие" -> Just "деепричастие"
    "деепричастный" -> Just "деепричастный"
    "дежурный" -> Just "дежурный"
    "дейксис" -> Just "дейксис"
    "действие" -> Just "действие"
    "действия" -> Just "действия"
    "делаем" -> Just "делать"
    "делает" -> Just "делать"
    "делаешь" -> Just "делать"
    "делать" -> Just "делать"
    "делаю" -> Just "делать"
    "делают" -> Just "делать"
    "день" -> Just "день"
    "деревянный" -> Just "деревянный"
    "диалога" -> Just "диалога"
    "диалоге" -> Just "диалоге"
    "дискурсная" -> Just "дискурсная"
    "дискурсный" -> Just "дискурсный"
    "длинно" -> Just "длинно"
    "добавить" -> Just "добавить"
    "добавление" -> Just "добавление"
    "добавляет" -> Just "добавляет"
    "добрый" -> Just "добрый"
    "дождь" -> Just "дождь"
    "дождя" -> Just "дождя"
    "документ" -> Just "документ"
    "должен" -> Just "должен"
    "должна" -> Just "должна"
    "должно" -> Just "должно"
    "должны" -> Just "должны"
    "дом" -> Just "дом"
    "дома" -> Just "дом"
    "доме" -> Just "дом"
    "домов" -> Just "домов"
    "домой" -> Just "домой"
    "домом" -> Just "дом"
    "дому" -> Just "дом"
    "дополнение" -> Just "дополнение"
    "дополнения" -> Just "дополнения"
    "дополнительные" -> Just "дополнительные"
    "достаточно" -> Just "достаточно"
    "доступ" -> Just "доступ"
    "друга" -> Just "друга"
    "другой" -> Just "другой"
    "другу" -> Just "другу"
    "думаем" -> Just "думать"
    "думает" -> Just "думать"
    "думаешь" -> Just "думать"
    "думать" -> Just "думать"
    "думаю" -> Just "думать"
    "думают" -> Just "думать"
    "его" -> Just "его"
    "ед" -> Just "ед"
    "едва" -> Just "едва"
    "единиц" -> Just "единиц"
    "единица" -> Just "единица"
    "ее" -> Just "ее"
    "ему" -> Just "ему"
    "есть" -> Just "быть"
    "еще" -> Just "еще"
    "жаль" -> Just "жаль"
    "ждать" -> Just "ждать"
    "ждет" -> Just "ждет"
    "желательно" -> Just "желательно"
    "живем" -> Just "жить"
    "живет" -> Just "жить"
    "живете" -> Just "жить"
    "живешь" -> Just "жить"
    "живу" -> Just "жить"
    "живут" -> Just "жить"
    "жить" -> Just "жить"
    "за" -> Just "за"
    "заболел" -> Just "заболел"
    "зависимое" -> Just "зависимое"
    "зависимости" -> Just "зависимости"
    "зависимость" -> Just "зависимость"
    "зависимые" -> Just "зависимые"
    "зависит" -> Just "зависит"
    "завтра" -> Just "завтра"
    "задает" -> Just "задает"
    "задай" -> Just "задай"
    "задача" -> Just "задача"
    "задаче" -> Just "задаче"
    "задачу" -> Just "задачу"
    "задают" -> Just "задают"
    "задумался" -> Just "задумался"
    "закрой" -> Just "закрой"
    "закрыта" -> Just "закрыта"
    "закрытый" -> Just "закрытый"
    "заменить" -> Just "заменить"
    "заполнитель" -> Just "заполнитель"
    "заполняет" -> Just "заполняет"
    "запрет" -> Just "запрет"
    "запрос" -> Just "запрос"
    "запускает" -> Just "запускает"
    "запятая" -> Just "запятая"
    "запятой" -> Just "запятой"
    "зато" -> Just "зато"
    "зачем" -> Just "зачем"
    "звонил" -> Just "звонил"
    "звука" -> Just "звука"
    "звукоподражание" -> Just "звукоподражание"
    "здание" -> Just "здание"
    "здесь" -> Just "здесь"
    "здравствуйте" -> Just "здравствуйте"
    "знает" -> Just "знает"
    "знаешь" -> Just "знаешь"
    "знал" -> Just "знал"
    "знании" -> Just "знании"
    "знания" -> Just "знания"
    "знать" -> Just "знать"
    "значение" -> Just "значение"
    "значения" -> Just "значения"
    "значит" -> Just "значит"
    "знаю" -> Just "знаю"
    "иван" -> Just "иван"
    "идентификация" -> Just "идентификация"
    "идет" -> Just "идет"
    "идея" -> Just "идея"
    "идти" -> Just "идти"
    "иду" -> Just "иду"
    "известно" -> Just "известно"
    "извлекать" -> Just "извлекать"
    "изменение" -> Just "изменение"
    "изменяется" -> Just "изменяется"
    "изменяются" -> Just "изменяются"
    "изоляции" -> Just "изоляции"
    "изъяснение" -> Just "изъяснение"
    "им" -> Just "им"
    "имеет" -> Just "имеет"
    "имеешь" -> Just "имеешь"
    "имени" -> Just "имени"
    "именительного" -> Just "именительного"
    "именная" -> Just "именная"
    "именно" -> Just "именно"
    "именной" -> Just "именной"
    "иметь" -> Just "иметь"
    "имеют" -> Just "имеют"
    "императив" -> Just "императив"
    "императивом" -> Just "императивом"
    "императивы" -> Just "императивы"
    "имя" -> Just "имя"
    "иначе" -> Just "иначе"
    "инженер" -> Just "инженер"
    "инженерная" -> Just "инженерная"
    "инженерное" -> Just "инженерное"
    "инженерной" -> Just "инженерной"
    "иногда" -> Just "иногда"
    "интересно" -> Just "интересно"
    "инфинитив" -> Just "инфинитив"
    "инфинитива" -> Just "инфинитива"
    "инфинитивы" -> Just "инфинитивы"
    "информацию" -> Just "информацию"
    "исключая" -> Just "исключая"
    "использовать" -> Just "использовать"
    "исправь" -> Just "исправь"
    "истина" -> Just "истина"
    "истине" -> Just "истина"
    "истиной" -> Just "истина"
    "истину" -> Just "истина"
    "истины" -> Just "истина"
    "исторически" -> Just "исторически"
    "источник" -> Just "источник"
    "исходную" -> Just "исходную"
    "исходя" -> Just "исходя"
    "исчезло" -> Just "исчезло"
    "их" -> Just "их"
    "ищи" -> Just "ищи"
    "кавычки" -> Just "кавычки"
    "каждый" -> Just "каждый"
    "кажется" -> Just "кажется"
    "казаться" -> Just "казаться"
    "какая" -> Just "какая"
    "какие" -> Just "какие"
    "какое" -> Just "какое"
    "какой" -> Just "какой"
    "кандидатов" -> Just "кандидатов"
    "карта" -> Just "карта"
    "картошка" -> Just "картошка"
    "категория" -> Just "категория"
    "качественные" -> Just "качественные"
    "качество" -> Just "качество"
    "кем" -> Just "кто"
    "класс" -> Just "класс"
    "классификации" -> Just "классификации"
    "классификация" -> Just "классификация"
    "классифицировать" -> Just "классифицировать"
    "классов" -> Just "классов"
    "классы" -> Just "классы"
    "клауза" -> Just "клауза"
    "клаузы" -> Just "клаузы"
    "ключ" -> Just "ключ"
    "ключа" -> Just "ключа"
    "ключи" -> Just "ключи"
    "ключом" -> Just "ключом"
    "книга" -> Just "книга"
    "книги" -> Just "книги"
    "книгу" -> Just "книгу"
    "кого" -> Just "кто"
    "код" -> Just "код"
    "количественные" -> Just "количественные"
    "количество" -> Just "количество"
    "ком" -> Just "кто"
    "команда" -> Just "команда"
    "команду" -> Just "команду"
    "команды" -> Just "команды"
    "комментарий" -> Just "комментарий"
    "комнате" -> Just "комнате"
    "кому" -> Just "кто"
    "конечно" -> Just "конечно"
    "конструкции" -> Just "конструкции"
    "конструкция" -> Just "конструкция"
    "конструкциях" -> Just "конструкциях"
    "контакт" -> Just "контакт"
    "контекст" -> Just "контекст"
    "контекста" -> Just "контекста"
    "контекстом" -> Just "контекстом"
    "контраст" -> Just "контраст"
    "короткая" -> Just "короткая"
    "короткие" -> Just "короткие"
    "короткий" -> Just "короткий"
    "коротких" -> Just "коротких"
    "коротко" -> Just "коротко"
    "короче" -> Just "короче"
    "коррекция" -> Just "коррекция"
    "косвенный" -> Just "косвенный"
    "космос" -> Just "космос"
    "которая" -> Just "которая"
    "которые" -> Just "которые"
    "который" -> Just "который"
    "кофе" -> Just "кофе"
    "кошка" -> Just "кошка"
    "красиво" -> Just "красиво"
    "красивый" -> Just "красивый"
    "красный" -> Just "красный"
    "краткая" -> Just "краткая"
    "краткие" -> Just "краткие"
    "краткий" -> Just "краткий"
    "краткое" -> Just "краткое"
    "критические" -> Just "критические"
    "критично" -> Just "критично"
    "кроме" -> Just "кроме"
    "кто" -> Just "кто"
    "кто-то" -> Just "кто-то"
    "куда" -> Just "куда"
    "купи" -> Just "купи"
    "купил" -> Just "купить"
    "купила" -> Just "купить"
    "купили" -> Just "купить"
    "купит" -> Just "купить"
    "купить" -> Just "купить"
    "купишь" -> Just "купить"
    "куплю" -> Just "купить"
    "курить" -> Just "курить"
    "ладно" -> Just "ладно"
    "лежит" -> Just "лежит"
    "лексические" -> Just "лексические"
    "летом" -> Just "летом"
    "лисий" -> Just "лисий"
    "лица" -> Just "лица"
    "лицо" -> Just "лицо"
    "личная" -> Just "личная"
    "личные" -> Just "личные"
    "лог" -> Just "лог"
    "логика" -> Just "логика"
    "логике" -> Just "логика"
    "логики" -> Just "логика"
    "логикой" -> Just "логика"
    "логику" -> Just "логика"
    "лозунг" -> Just "лозунг"
    "локализация" -> Just "локализация"
    "локальной" -> Just "локальной"
    "ломает" -> Just "ломает"
    "ломают" -> Just "ломают"
    "лучше" -> Just "лучше"
    "люблю" -> Just "люблю"
    "любой" -> Just "любой"
    "люди" -> Just "люди"
    "мало" -> Just "мало"
    "мальчик" -> Just "мальчик"
    "мама" -> Just "мама"
    "мамин" -> Just "мамин"
    "маркер" -> Just "маркер"
    "маркеры" -> Just "маркеры"
    "маркирует" -> Just "маркирует"
    "машинно-полезные" -> Just "машинно-полезные"
    "междометие" -> Just "междометие"
    "междометия" -> Just "междометия"
    "ментальное" -> Just "ментальное"
    "ментальные" -> Just "ментальные"
    "меньше" -> Just "меньше"
    "меня" -> Just "я"
    "меняет" -> Just "меняет"
    "меняется" -> Just "меняется"
    "меняют" -> Just "меняют"
    "места" -> Just "места"
    "место" -> Just "место"
    "местоимение" -> Just "местоимение"
    "местоимений" -> Just "местоимений"
    "местоимения" -> Just "местоимения"
    "местоименное" -> Just "местоименное"
    "метро" -> Just "метро"
    "минимальная" -> Just "минимальная"
    "минимальные" -> Just "минимальные"
    "минимальный" -> Just "минимальный"
    "минимум" -> Just "минимум"
    "мн" -> Just "мн"
    "мне" -> Just "я"
    "много" -> Just "много"
    "мной" -> Just "я"
    "мною" -> Just "я"
    "могу" -> Just "могу"
    "могут" -> Just "могут"
    "модальность" -> Just "модальность"
    "модальные" -> Just "модальные"
    "модель" -> Just "модель"
    "модификатор" -> Just "модификатор"
    "модификаторы" -> Just "модификаторы"
    "модифицирует" -> Just "модифицирует"
    "может" -> Just "может"
    "можешь" -> Just "можешь"
    "можно" -> Just "можно"
    "мои" -> Just "мои"
    "мой" -> Just "мой"
    "молоко" -> Just "молоко"
    "молчать" -> Just "молчать"
    "молчит" -> Just "молчит"
    "море" -> Just "море"
    "морфема" -> Just "морфема"
    "морфологические" -> Just "морфологические"
    "морфологический" -> Just "морфологический"
    "морфологию" -> Just "морфологию"
    "морфология" -> Just "морфология"
    "москва" -> Just "москва"
    "мочь" -> Just "мочь"
    "мы" -> Just "мы"
    "мысль" -> Just "мысль"
    "мыть" -> Just "мыть"
    "мяу" -> Just "мяу"
    "набор" -> Just "набор"
    "наверное" -> Just "наверное"
    "надо" -> Just "надо"
    "название" -> Just "название"
    "называет" -> Just "называет"
    "называется" -> Just "называется"
    "назывное" -> Just "назывное"
    "наивного" -> Just "наивного"
    "найди" -> Just "найди"
    "найти" -> Just "найти"
    "наклонение" -> Just "наклонение"
    "наклонения" -> Just "наклонения"
    "наличие" -> Just "наличие"
    "налоги" -> Just "налоги"
    "нам" -> Just "мы"
    "нами" -> Just "мы"
    "наоборот" -> Just "наоборот"
    "написал" -> Just "написал"
    "написано" -> Just "написано"
    "напиши" -> Just "напиши"
    "направление" -> Just "направление"
    "например" -> Just "например"
    "напрямую" -> Just "напрямую"
    "наречие" -> Just "наречие"
    "наречием" -> Just "наречием"
    "наречия" -> Just "наречия"
    "наречиями" -> Just "наречиями"
    "наречные" -> Just "наречные"
    "наречный" -> Just "наречный"
    "нас" -> Just "мы"
    "настоящее" -> Just "настоящее"
    "настоящем" -> Just "настоящем"
    "наука" -> Just "наука"
    "находится" -> Just "находится"
    "начал" -> Just "начал"
    "начале" -> Just "начале"
    "начало" -> Just "начало"
    "начнем" -> Just "начнем"
    "неба" -> Just "небо"
    "небе" -> Just "небо"
    "небо" -> Just "небо"
    "небом" -> Just "небо"
    "небу" -> Just "небо"
    "неверно" -> Just "неверно"
    "неверный" -> Just "неверный"
    "неизвестен" -> Just "неизвестен"
    "неизменяемость" -> Just "неизменяемость"
    "некрасивый" -> Just "некрасивый"
    "нельзя" -> Just "нельзя"
    "ненавидеть" -> Just "ненавидеть"
    "неоднозначность" -> Just "неоднозначность"
    "неопределенность" -> Just "неопределенность"
    "непостоянные" -> Just "непостоянные"
    "неправильно" -> Just "неправильно"
    "несклоняемые" -> Just "несклоняемые"
    "несколько" -> Just "несколько"
    "несмотря" -> Just "несмотря"
    "несовершенный" -> Just "несовершенный"
    "нет" -> Just "нет"
    "ниже" -> Just "ниже"
    "никакой" -> Just "никакой"
    "никогда" -> Just "никогда"
    "никто" -> Just "никто"
    "ничего" -> Just "ничего"
    "ничто" -> Just "ничто"
    "новая" -> Just "новая"
    "новый" -> Just "новый"
    "ножницы" -> Just "ножницы"
    "норм" -> Just "норм"
    "нормально" -> Just "нормально"
    "нравится" -> Just "нравится"
    "ну" -> Just "ну"
    "ну-ка" -> Just "ну-ка"
    "нужен" -> Just "нужный"
    "нужна" -> Just "нужный"
    "нужная" -> Just "нужный"
    "нужно" -> Just "нужный"
    "нужное" -> Just "нужный"
    "нужны" -> Just "нужный"
    "нужные" -> Just "нужный"
    "нужный" -> Just "нужный"
    "оба" -> Just "оба"
    "обвиняемый" -> Just "обвиняемый"
    "обе" -> Just "обе"
    "обещал" -> Just "обещал"
    "область" -> Just "область"
    "обозначает" -> Just "обозначает"
    "обозначающая" -> Just "обозначающая"
    "оборот" -> Just "оборот"
    "обрабатывать" -> Just "обрабатывать"
    "обращение" -> Just "обращение"
    "обращения" -> Just "обращения"
    "обстоятельство" -> Just "обстоятельство"
    "обстоятельством" -> Just "обстоятельством"
    "обсудим" -> Just "обсудить"
    "обсудите" -> Just "обсудить"
    "обсудить" -> Just "обсудить"
    "обсуждать" -> Just "обсуждать"
    "общая" -> Just "общая"
    "общения" -> Just "общения"
    "объединить" -> Just "объединить"
    "объект" -> Just "объект"
    "объектом" -> Just "объектом"
    "объекты" -> Just "объекты"
    "объяснения" -> Just "объяснения"
    "объясни" -> Just "объясни"
    "объяснить" -> Just "объяснить"
    "обычно" -> Just "обычно"
    "обычное" -> Just "обычное"
    "обычный" -> Just "обычный"
    "обычным" -> Just "обычным"
    "обязан" -> Just "обязан"
    "обязательно" -> Just "обязательно"
    "ограничение" -> Just "ограничение"
    "ограничения" -> Just "ограничения"
    "один" -> Just "один"
    "одна" -> Just "одна"
    "однако" -> Just "однако"
    "одни" -> Just "одни"
    "одно" -> Just "одно"
    "одновременно" -> Just "одновременно"
    "одного" -> Just "одного"
    "одному" -> Just "одному"
    "однородные" -> Just "однородные"
    "однословно" -> Just "однословно"
    "однословное" -> Just "однословное"
    "ожидание" -> Just "ожидание"
    "озеро" -> Just "озеро"
    "означает" -> Just "означает"
    "означать" -> Just "означать"
    "ой" -> Just "ой"
    "оказалась" -> Just "оказаться"
    "оказались" -> Just "оказаться"
    "оказалось" -> Just "оказаться"
    "оказался" -> Just "оказаться"
    "оказаться" -> Just "оказаться"
    "оказывается" -> Just "оказаться"
    "окна" -> Just "окна"
    "окно" -> Just "окно"
    "окончания" -> Just "окончания"
    "омонимии" -> Just "омонимии"
    "омонимия" -> Just "омонимия"
    "он" -> Just "он"
    "она" -> Just "она"
    "они" -> Just "они"
    "оно" -> Just "оно"
    "оператор" -> Just "оператор"
    "описывает" -> Just "описывает"
    "описываются" -> Just "описываются"
    "опоздал" -> Just "опоздал"
    "определение" -> Just "определение"
    "определитель" -> Just "определитель"
    "определяет" -> Just "определяет"
    "опять" -> Just "опять"
    "осени" -> Just "осень"
    "осень" -> Just "осень"
    "осенью" -> Just "осень"
    "основной" -> Just "основной"
    "основные" -> Just "основные"
    "особая" -> Just "особая"
    "особенно" -> Just "особенно"
    "особые" -> Just "особые"
    "остался" -> Just "остался"
    "ответ" -> Just "ответ"
    "ответа" -> Just "ответа"
    "ответил" -> Just "ответил"
    "ответить" -> Just "ответить"
    "ответы" -> Just "ответы"
    "отвечает" -> Just "отвечает"
    "отвечать" -> Just "отвечать"
    "отдельно" -> Just "отдельно"
    "отдельного" -> Just "отдельного"
    "отдельные" -> Just "отдельные"
    "отдельный" -> Just "отдельный"
    "отказ" -> Just "отказ"
    "открой" -> Just "открой"
    "открывай" -> Just "открывай"
    "открыл" -> Just "открыл"
    "открыта" -> Just "открыта"
    "открыто" -> Just "открыто"
    "открыть" -> Just "открыть"
    "откуда" -> Just "откуда"
    "отличается" -> Just "отличается"
    "отличать" -> Just "отличать"
    "отличие" -> Just "отличие"
    "отложить" -> Just "отложить"
    "относительное" -> Just "относительное"
    "относится" -> Just "относится"
    "отношение" -> Just "отношение"
    "отношении" -> Just "отношении"
    "отношений" -> Just "отношений"
    "отношения" -> Just "отношения"
    "отождествление" -> Just "отождествление"
    "отправил" -> Just "отправил"
    "отправь" -> Just "отправь"
    "отрицается" -> Just "отрицается"
    "отрицание" -> Just "отрицание"
    "отрицания" -> Just "отрицания"
    "отрицательная" -> Just "отрицательная"
    "отрицательное" -> Just "отрицательное"
    "отрицательные" -> Just "отрицательные"
    "отрицательный" -> Just "отрицательный"
    "отсутствие" -> Just "отсутствие"
    "отсутствия" -> Just "отсутствия"
    "оттенков" -> Just "оттенков"
    "отца" -> Just "отца"
    "отчет" -> Just "отчет"
    "оформи" -> Just "оформи"
    "ох" -> Just "ох"
    "оценка" -> Just "оценка"
    "оценку" -> Just "оценку"
    "очень" -> Just "очень"
    "ошибка" -> Just "ошибка"
    "ошибки" -> Just "ошибки"
    "ошибся" -> Just "ошибся"
    "падеж" -> Just "падеж"
    "падежа" -> Just "падежа"
    "падежам" -> Just "падежам"
    "падеже" -> Just "падеже"
    "падежи" -> Just "падежи"
    "падежное" -> Just "падежное"
    "падежом" -> Just "падежом"
    "пальто" -> Just "пальто"
    "первого" -> Just "первого"
    "первый" -> Just "первый"
    "переведи" -> Just "переведи"
    "перепиши" -> Just "перепиши"
    "переспрос" -> Just "переспрос"
    "переформулируй" -> Just "переформулируй"
    "переход" -> Just "переход"
    "переходность" -> Just "переходность"
    "печь" -> Just "печь"
    "писал" -> Just "писал"
    "письмо" -> Just "письмо"
    "пиши" -> Just "пиши"
    "пишу" -> Just "пишу"
    "план" -> Just "план"
    "плохой" -> Just "плохой"
    "плюс" -> Just "плюс"
    "по-русски" -> Just "по-русски"
    "поболтаем" -> Just "поболтаем"
    "побуждение" -> Just "побуждение"
    "поведение" -> Just "поведение"
    "повелительное" -> Just "повелительное"
    "поводу" -> Just "поводу"
    "повтори" -> Just "повтори"
    "повторяющийся" -> Just "повторяющийся"
    "повышает" -> Just "повышает"
    "повышается" -> Just "повышается"
    "поговорим" -> Just "поговорить"
    "поговорите" -> Just "поговорить"
    "поговорить" -> Just "поговорить"
    "пограничные" -> Just "пограничные"
    "подлежащего" -> Just "подлежащего"
    "подлежащее" -> Just "подлежащее"
    "подлежащим" -> Just "подлежащим"
    "подробнее" -> Just "подробнее"
    "подтверждение" -> Just "подтверждение"
    "подтип" -> Just "подтип"
    "подумал" -> Just "подумал"
    "подчинительный" -> Just "подчинительный"
    "поезд" -> Just "поезд"
    "пожалуйста" -> Just "пожалуйста"
    "поздно" -> Just "поздно"
    "позже" -> Just "позже"
    "позиции" -> Just "позиции"
    "позиция" -> Just "позиция"
    "пойдем" -> Just "пойдем"
    "пойду" -> Just "пойду"
    "пока" -> Just "пока"
    "покажи" -> Just "покажи"
    "показывай" -> Just "показывай"
    "полезно" -> Just "полезно"
    "полезны" -> Just "полезны"
    "полисемия" -> Just "полисемия"
    "полная" -> Just "полная"
    "полное" -> Just "полное"
    "полноценный" -> Just "полноценный"
    "положительная" -> Just "положительная"
    "получает" -> Just "получает"
    "пользователь" -> Just "пользователь"
    "помечать" -> Just "помечать"
    "помнить" -> Just "помнить"
    "помнишь" -> Just "помнишь"
    "помог" -> Just "помог"
    "помогает" -> Just "помогает"
    "помоги" -> Just "помоги"
    "помочь" -> Just "помочь"
    "понимания" -> Just "понимания"
    "понимать" -> Just "понимать"
    "понимаю" -> Just "понимаю"
    "понял" -> Just "понял"
    "понятно" -> Just "понятно"
    "пора" -> Just "пора"
    "порядковое" -> Just "порядковое"
    "порядковые" -> Just "порядковые"
    "порядок" -> Just "порядок"
    "после" -> Just "после"
    "посмотрел" -> Just "посмотрел"
    "постоянные" -> Just "постоянные"
    "построен" -> Just "построен"
    "построили" -> Just "построили"
    "построить" -> Just "построить"
    "потом" -> Just "потом"
    "похоже" -> Just "похоже"
    "почему" -> Just "почему"
    "почитать" -> Just "почитать"
    "почти" -> Just "почти"
    "пошел" -> Just "пошел"
    "поэтому" -> Just "поэтому"
    "поясни" -> Just "поясни"
    "прав" -> Just "прав"
    "правда" -> Just "правда"
    "правде" -> Just "правда"
    "правдой" -> Just "правда"
    "правду" -> Just "правда"
    "правды" -> Just "правда"
    "правила" -> Just "правила"
    "правило" -> Just "правило"
    "правильно" -> Just "правильно"
    "предикат" -> Just "предикат"
    "предикате" -> Just "предикате"
    "предикатив" -> Just "предикатив"
    "предикатом" -> Just "предикатом"
    "предл" -> Just "предл"
    "предлог" -> Just "предлог"
    "предлога" -> Just "предлога"
    "предлоги" -> Just "предлоги"
    "предложение" -> Just "предложение"
    "предложении" -> Just "предложении"
    "предложения" -> Just "предложения"
    "предложный" -> Just "предложный"
    "предмет" -> Just "предмет"
    "предмета" -> Just "предмета"
    "предупреждение" -> Just "предупреждение"
    "предыдущего" -> Just "предыдущего"
    "привет" -> Just "привет"
    "приводит" -> Just "приводит"
    "приглашение" -> Just "приглашение"
    "придаточного" -> Just "придаточного"
    "придаточное" -> Just "придаточное"
    "придет" -> Just "придет"
    "придумай" -> Just "придумай"
    "признак" -> Just "признак"
    "признака" -> Just "признака"
    "признаки" -> Just "признаки"
    "прийти" -> Just "прийти"
    "прикрепляется" -> Just "прикрепляется"
    "прилагательного" -> Just "прилагательного"
    "прилагательное" -> Just "прилагательное"
    "прилагательные" -> Just "прилагательные"
    "прилагательным" -> Just "прилагательным"
    "пример" -> Just "пример"
    "примерно" -> Just "примерно"
    "примеры" -> Just "примеры"
    "принадлежность" -> Just "принадлежность"
    "принцип" -> Just "принцип"
    "притяжательное" -> Just "притяжательное"
    "причастие" -> Just "причастие"
    "причастия" -> Just "причастия"
    "причастный" -> Just "причастный"
    "причастных" -> Just "причастных"
    "причина" -> Just "причина"
    "причинность" -> Just "причинность"
    "причины" -> Just "причины"
    "пришел" -> Just "пришел"
    "проблема" -> Just "проблема"
    "проверил" -> Just "проверил"
    "проверить" -> Just "проверить"
    "проверка" -> Just "проверка"
    "проверь" -> Just "проверь"
    "проверять" -> Just "проверять"
    "продолжение" -> Just "продолжение"
    "производные" -> Just "производные"
    "производный" -> Just "производный"
    "происходит" -> Just "происходит"
    "просит" -> Just "просит"
    "просто" -> Just "просто"
    "простой" -> Just "простой"
    "пространство" -> Just "пространство"
    "просьба" -> Just "просьба"
    "просьбы" -> Just "просьбы"
    "противительный" -> Just "противительный"
    "противопоставление" -> Just "противопоставление"
    "прочитав" -> Just "прочитав"
    "прочитай" -> Just "прочитай"
    "прочитал" -> Just "прочитал"
    "прочитанная" -> Just "прочитанная"
    "прочитанный" -> Just "прочитанный"
    "прошедшего" -> Just "прошедшего"
    "прошедшее" -> Just "прошедшее"
    "проще" -> Just "проще"
    "прямо" -> Just "прямо"
    "пунктуацию" -> Just "пунктуацию"
    "пунктуация" -> Just "пунктуация"
    "путать" -> Just "путать"
    "путь" -> Just "путь"
    "пушкин" -> Just "пушкин"
    "пяти" -> Just "пяти"
    "пять" -> Just "пять"
    "работает" -> Just "работает"
    "работать" -> Just "работать"
    "рабочий" -> Just "рабочий"
    "рабочими" -> Just "рабочими"
    "равно" -> Just "равно"
    "рад" -> Just "рад"
    "рада" -> Just "рада"
    "ради" -> Just "ради"
    "радость" -> Just "радость"
    "раз" -> Just "раз"
    "разбор" -> Just "разбор"
    "разговорные" -> Just "разговорные"
    "разговорный" -> Just "разговорный"
    "разговору" -> Just "разговору"
    "раздалось" -> Just "раздалось"
    "раздельное" -> Just "раздельное"
    "различать" -> Just "различать"
    "различие" -> Just "различие"
    "разные" -> Just "разные"
    "разных" -> Just "разных"
    "разряд" -> Just "разряд"
    "разу" -> Just "разу"
    "рамочные" -> Just "рамочные"
    "рано" -> Just "рано"
    "раньше" -> Just "раньше"
    "распознавания" -> Just "распознавания"
    "распознавать" -> Just "распознавать"
    "расскажи" -> Just "расскажи"
    "реакции" -> Just "реакции"
    "реакция" -> Just "реакция"
    "реализации" -> Just "реализации"
    "ребенок" -> Just "ребенок"
    "редко" -> Just "редко"
    "река" -> Just "река"
    "реки" -> Just "реки"
    "рекомендация" -> Just "рекомендация"
    "рекомендуемый" -> Just "рекомендуемый"
    "реплик" -> Just "реплик"
    "реплика" -> Just "реплика"
    "реплики" -> Just "реплики"
    "репликой" -> Just "репликой"
    "референт" -> Just "референт"
    "речевой" -> Just "речевой"
    "речевые" -> Just "речевые"
    "речи" -> Just "речи"
    "решение" -> Just "решение"
    "решить" -> Just "решить"
    "ровно" -> Just "ровно"
    "род" -> Just "род"
    "рода" -> Just "рода"
    "родительный" -> Just "родительный"
    "роли" -> Just "роли"
    "роль" -> Just "роль"
    "руки" -> Just "руки"
    "русская" -> Just "русская"
    "русский" -> Just "русский"
    "русских" -> Just "русских"
    "русского" -> Just "русского"
    "русском" -> Just "русском"
    "ручкой" -> Just "ручкой"
    "рядом" -> Just "рядом"
    "сайт" -> Just "сайт"
    "сам" -> Just "сам"
    "самое" -> Just "самое"
    "самостоятельная" -> Just "самостоятельная"
    "самостоятельный" -> Just "самостоятельный"
    "самый" -> Just "самый"
    "сбой" -> Just "сбой"
    "сборка" -> Just "сборка"
    "свет" -> Just "свет"
    "свобода" -> Just "свобода"
    "свой" -> Just "свой"
    "связан" -> Just "связан"
    "связи" -> Just "связи"
    "связка" -> Just "связка"
    "связочные" -> Just "связочные"
    "связочный" -> Just "связочный"
    "связывает" -> Just "связывает"
    "связь" -> Just "связь"
    "сгенерируй" -> Just "сгенерируй"
    "сделай" -> Just "сделай"
    "сделал" -> Just "сделал"
    "сделать" -> Just "сделать"
    "себе" -> Just "себе"
    "себя" -> Just "себя"
    "сегодня" -> Just "сегодня"
    "сейчас" -> Just "сейчас"
    "семантика" -> Just "семантика"
    "семантическая" -> Just "семантическая"
    "семантические" -> Just "семантические"
    "семантической" -> Just "семантической"
    "сервер" -> Just "сервер"
    "сестре" -> Just "сестре"
    "сигнал" -> Just "сигнал"
    "силен" -> Just "силен"
    "синтаксис" -> Just "синтаксис"
    "синтаксическая" -> Just "синтаксическая"
    "синтаксически" -> Just "синтаксически"
    "синтаксические" -> Just "синтаксические"
    "синтаксический" -> Just "синтаксический"
    "синтаксической" -> Just "синтаксической"
    "синтаксическую" -> Just "синтаксическую"
    "синхронно" -> Just "синхронно"
    "система" -> Just "система"
    "системе" -> Just "системе"
    "системы" -> Just "системы"
    "ситуации" -> Just "ситуации"
    "скажи" -> Just "скажи"
    "скажи-ка" -> Just "скажи-ка"
    "сказал" -> Just "сказал"
    "сказать" -> Just "сказать"
    "сказуемого" -> Just "сказуемого"
    "сказуемое" -> Just "сказуемое"
    "сказуемым" -> Just "сказуемым"
    "склонение" -> Just "склонение"
    "сколько" -> Just "сколько"
    "скрывается" -> Just "скрываться"
    "скрываться" -> Just "скрываться"
    "скрываются" -> Just "скрываться"
    "скучно" -> Just "скучно"
    "слева" -> Just "слева"
    "следовательно" -> Just "следовательно"
    "следствие" -> Just "следствие"
    "слитное" -> Just "слитное"
    "слишком" -> Just "слишком"
    "слов" -> Just "слов"
    "слова" -> Just "слова"
    "словам" -> Just "словам"
    "словарь" -> Just "словарь"
    "словно" -> Just "словно"
    "слово" -> Just "слово"
    "словом" -> Just "словом"
    "словоформа" -> Just "словоформа"
    "слову" -> Just "слову"
    "сложного" -> Just "сложного"
    "слой" -> Just "слой"
    "служебная" -> Just "служебная"
    "служебные" -> Just "служебные"
    "случаи" -> Just "случаи"
    "случай" -> Just "случай"
    "случилось" -> Just "случилось"
    "слушай" -> Just "слушай"
    "слышишь" -> Just "слышишь"
    "смотря" -> Just "смотря"
    "смысл" -> Just "смысл"
    "смысла" -> Just "смысл"
    "смысле" -> Just "смысл"
    "смыслом" -> Just "смысл"
    "смыслу" -> Just "смысл"
    "смягчение" -> Just "смягчение"
    "сначала" -> Just "сначала"
    "снег" -> Just "снег"
    "снега" -> Just "снега"
    "собака" -> Just "собака"
    "собирательное" -> Just "собирательное"
    "собственное" -> Just "собственное"
    "событие" -> Just "событие"
    "события" -> Just "события"
    "совершенный" -> Just "совершенный"
    "совсем" -> Just "совсем"
    "согласие" -> Just "согласие"
    "согласиться" -> Just "согласиться"
    "согласно" -> Just "согласно"
    "согласование" -> Just "согласование"
    "согласования" -> Just "согласования"
    "согласуется" -> Just "согласуется"
    "содержание" -> Just "содержание"
    "содержит" -> Just "содержит"
    "соединяет" -> Just "соединяет"
    "создай" -> Just "создай"
    "создать" -> Just "создать"
    "сократи" -> Just "сократи"
    "сомневаюсь" -> Just "сомневаюсь"
    "сомнение" -> Just "сомнение"
    "сон" -> Just "сон"
    "сообщение" -> Just "сообщение"
    "составе" -> Just "составе"
    "составной" -> Just "составной"
    "составные" -> Just "составные"
    "составь" -> Just "составь"
    "состоит" -> Just "состоит"
    "состояние" -> Just "состояние"
    "состояния" -> Just "состояния"
    "сохранить" -> Just "сохранить"
    "сохраняем" -> Just "сохранять"
    "сохраняет" -> Just "сохранять"
    "сохраняешь" -> Just "сохранять"
    "сохранять" -> Just "сохранять"
    "сохраняю" -> Just "сохранять"
    "сохраняют" -> Just "сохранять"
    "социальная" -> Just "социальная"
    "сочетание" -> Just "сочетание"
    "сочинение" -> Just "сочинение"
    "союз" -> Just "союз"
    "союза" -> Just "союза"
    "союзное" -> Just "союзное"
    "союзов" -> Just "союзов"
    "союзом" -> Just "союзом"
    "союзы" -> Just "союзы"
    "спал" -> Just "спал"
    "спасибо" -> Just "спасибо"
    "спать" -> Just "спать"
    "списки" -> Just "списки"
    "список" -> Just "список"
    "спит" -> Just "спит"
    "спокойно" -> Just "спокойно"
    "спорить" -> Just "спорить"
    "способ" -> Just "способ"
    "способе" -> Just "способе"
    "справа" -> Just "справа"
    "спросил" -> Just "спросил"
    "спросить" -> Just "спросить"
    "ср" -> Just "ср"
    "сравнение" -> Just "сравнение"
    "сравнения" -> Just "сравнения"
    "сравни" -> Just "сравни"
    "сравнительная" -> Just "сравнительная"
    "сравнительный" -> Just "сравнительный"
    "сразу" -> Just "сразу"
    "стал" -> Just "стал"
    "стали" -> Just "стали"
    "становилось" -> Just "становилось"
    "старший" -> Just "старший"
    "старый" -> Just "старый"
    "статус" -> Just "статус"
    "стать" -> Just "стать"
    "стемнело" -> Just "стемнело"
    "степени" -> Just "степени"
    "степень" -> Just "степень"
    "сто" -> Just "сто"
    "стоит" -> Just "стоит"
    "стол" -> Just "стол"
    "стола" -> Just "стол"
    "столе" -> Just "стол"
    "столовая" -> Just "столовая"
    "столом" -> Just "стол"
    "столу" -> Just "стол"
    "столы" -> Just "стол"
    "столько" -> Just "столько"
    "стоп" -> Just "стоп"
    "сторонам" -> Just "сторонам"
    "страдательное" -> Just "страдательное"
    "странно" -> Just "странно"
    "страшно" -> Just "страшно"
    "строительство" -> Just "строительство"
    "строить" -> Just "строить"
    "строка" -> Just "строка"
    "структура" -> Just "структура"
    "структуры" -> Just "структуры"
    "субстантивации" -> Just "субстантивации"
    "субстантивацию" -> Just "субстантивацию"
    "субстантивация" -> Just "субстантивация"
    "субстантивированное" -> Just "субстантивированное"
    "субъект" -> Just "субъект"
    "субъектности" -> Just "субъектность"
    "субъектность" -> Just "субъектность"
    "субъектностью" -> Just "субъектность"
    "суффиксы" -> Just "суффиксы"
    "существительного" -> Just "существительного"
    "существительное" -> Just "существительное"
    "существительные" -> Just "существительные"
    "существительным" -> Just "существительным"
    "существительных" -> Just "существительных"
    "существование" -> Just "существование"
    "схема" -> Just "схема"
    "считать" -> Just "считать"
    "сюда" -> Just "сюда"
    "таблица" -> Just "таблица"
    "таблицу" -> Just "таблицу"
    "так" -> Just "так"
    "такая" -> Just "такой"
    "также" -> Just "также"
    "такие" -> Just "такой"
    "такого" -> Just "такой"
    "такое" -> Just "такой"
    "такой" -> Just "такой"
    "такси" -> Just "такси"
    "такую" -> Just "такой"
    "там" -> Just "там"
    "твор" -> Just "твор"
    "творительный" -> Just "творительный"
    "тебе" -> Just "ты"
    "тебя" -> Just "ты"
    "тег" -> Just "тег"
    "текст" -> Just "текст"
    "текста" -> Just "текста"
    "телефон" -> Just "телефон"
    "тем" -> Just "тем"
    "тема" -> Just "тема"
    "темнее" -> Just "темнее"
    "темно" -> Just "темно"
    "тему" -> Just "тему"
    "темы" -> Just "темы"
    "теперь" -> Just "теперь"
    "тепло" -> Just "тепло"
    "тесты" -> Just "тесты"
    "течение" -> Just "течение"
    "тип" -> Just "тип"
    "типа" -> Just "типа"
    "типичные" -> Just "типичные"
    "типовые" -> Just "типовые"
    "типы" -> Just "типы"
    "тире" -> Just "тире"
    "тихо" -> Just "тихо"
    "тише" -> Just "тише"
    "тишина" -> Just "тишина"
    "то" -> Just "то"
    "тобой" -> Just "ты"
    "тобою" -> Just "ты"
    "того" -> Just "того"
    "тоже" -> Just "тоже"
    "токен" -> Just "токен"
    "токена" -> Just "токена"
    "токены" -> Just "токены"
    "тот" -> Just "тот"
    "требование" -> Just "требование"
    "требует" -> Just "требует"
    "требуют" -> Just "требуют"
    "три" -> Just "три"
    "трудно" -> Just "трудно"
    "туда" -> Just "туда"
    "тут" -> Just "тут"
    "ты" -> Just "ты"
    "уверен" -> Just "уверен"
    "уверенно" -> Just "уверенно"
    "уверенность" -> Just "уверенность"
    "увы" -> Just "увы"
    "удали" -> Just "удали"
    "удалить" -> Just "удалить"
    "удаляй" -> Just "удаляй"
    "удивительно" -> Just "удивительно"
    "уж" -> Just "уж"
    "уже" -> Just "уже"
    "узкий" -> Just "узкий"
    "уйти" -> Just "уйти"
    "указание" -> Just "указание"
    "указательное" -> Just "указательное"
    "указывает" -> Just "указывает"
    "улице" -> Just "улице"
    "улучши" -> Just "улучши"
    "улыбаться" -> Just "улыбаться"
    "улыбаясь" -> Just "улыбаясь"
    "упала" -> Just "упала"
    "употребление" -> Just "употребление"
    "управление" -> Just "управление"
    "ура" -> Just "ура"
    "уровне" -> Just "уровне"
    "урока" -> Just "урока"
    "усиление" -> Just "усиление"
    "усиления" -> Just "усиления"
    "усиливает" -> Just "усиливает"
    "усилитель" -> Just "усилитель"
    "усилительная" -> Just "усилительная"
    "усилительное" -> Just "усилительное"
    "условие" -> Just "условие"
    "условии" -> Just "условии"
    "условного" -> Just "условного"
    "условное" -> Just "условное"
    "условном" -> Just "условном"
    "устал" -> Just "устал"
    "устойчивые" -> Just "устойчивые"
    "уточнение" -> Just "уточнение"
    "уточнить" -> Just "уточнить"
    "уточняющий" -> Just "уточняющий"
    "утром" -> Just "утром"
    "участник" -> Just "участник"
    "участников" -> Just "участников"
    "учащийся" -> Just "учащийся"
    "учитель" -> Just "учитель"
    "учителя" -> Just "учителя"
    "учитывать" -> Just "учитывать"
    "учреждение" -> Just "учреждение"
    "ушел" -> Just "ушел"
    "ушли" -> Just "ушли"
    "файл" -> Just "файл"
    "фильм" -> Just "фильм"
    "фокус" -> Just "фокус"
    "форм" -> Just "форм"
    "форма" -> Just "форма"
    "формат" -> Just "формат"
    "форме" -> Just "форме"
    "формой" -> Just "формой"
    "формообразующая" -> Just "формообразующая"
    "форму" -> Just "форму"
    "формулы" -> Just "формулы"
    "формы" -> Just "формы"
    "фотосинтез" -> Just "фотосинтез"
    "фрагмент" -> Just "фрагмент"
    "фрагменты" -> Just "фрагменты"
    "фу" -> Just "фу"
    "функцией" -> Just "функция"
    "функции" -> Just "функция"
    "функцию" -> Just "функция"
    "функция" -> Just "функция"
    "хватит" -> Just "хватит"
    "хлеб" -> Just "хлеб"
    "холодно" -> Just "холодно"
    "хороший" -> Just "хороший"
    "хорошо" -> Just "хорошо"
    "хотел" -> Just "хотел"
    "хотеть" -> Just "хотеть"
    "хочу" -> Just "хочу"
    "хранить" -> Just "хранить"
    "хуже" -> Just "хуже"
    "цели" -> Just "цели"
    "цель" -> Just "цель"
    "целью" -> Just "целью"
    "центр" -> Just "центр"
    "чай" -> Just "чай"
    "час" -> Just "час"
    "частей" -> Just "частей"
    "части" -> Just "части"
    "частица" -> Just "частица"
    "частицу" -> Just "частицу"
    "частицы" -> Just "частицы"
    "частично" -> Just "частично"
    "часто" -> Just "часто"
    "часть" -> Just "часть"
    "чате" -> Just "чате"
    "чаще" -> Just "чаще"
    "че" -> Just "че"
    "чего" -> Just "что"
    "чей" -> Just "чей"
    "человек" -> Just "человек"
    "чем" -> Just "что"
    "чему" -> Just "что"
    "четыре" -> Just "четыре"
    "числа" -> Just "числа"
    "числительного" -> Just "числительного"
    "числительное" -> Just "числительное"
    "числительные" -> Just "числительные"
    "число" -> Just "число"
    "читает" -> Just "читает"
    "читать" -> Just "читать"
    "читаю" -> Just "читаю"
    "читающий" -> Just "читающий"
    "читая" -> Just "читая"
    "член" -> Just "член"
    "членами" -> Just "членами"
    "членом" -> Just "членом"
    "члены" -> Just "члены"
    "чтение" -> Just "чтение"
    "что" -> Just "что"
    "что-нибудь" -> Just "что-нибудь"
    "что-то" -> Just "что-то"
    "шел" -> Just "шел"
    "школа" -> Just "школа"
    "школу" -> Just "школу"
    "школьная" -> Just "школьная"
    "школьного" -> Just "школьного"
    "школьной" -> Just "школьной"
    "школьный" -> Just "школьный"
    "шум" -> Just "шум"
    "эвристики" -> Just "эвристики"
    "эй" -> Just "эй"
    "экспрессия" -> Just "экспрессия"
    "элемент" -> Just "элемент"
    "эллипсис" -> Just "эллипсис"
    "эмоциональная" -> Just "эмоциональная"
    "эта" -> Just "эта"
    "этикетные" -> Just "этикетные"
    "это" -> Just "это"
    "этот" -> Just "этот"
    "эту" -> Just "эту"
    "эх" -> Just "эх"
    "я" -> Just "я"
    "явление" -> Just "явление"
    "является" -> Just "являться"
    "являешься" -> Just "являться"
    "являться" -> Just "являться"
    "являюсь" -> Just "являться"
    "явно" -> Just "явно"
    "явного" -> Just "явного"
    "ядра" -> Just "ядра"
    "ядро" -> Just "ядро"
    _ -> Nothing

generatedLemmaToPos :: Text -> Maybe InputPartOfSpeech
generatedLemmaToPos t = case t of
    "абстрактное" -> Just PosAdjective
    "автоматически" -> Just PosNoun
    "автором" -> Just PosNoun
    "ага" -> Just PosNoun
    "адресат" -> Just PosNoun
    "алло" -> Just PosAdverb
    "анализ" -> Just PosNoun
    "анализа" -> Just PosNoun
    "ах" -> Just PosInterjection
    "базового" -> Just PosAdjective
    "базовые" -> Just PosAdjective
    "бах" -> Just PosNoun
    "безличная" -> Just PosAdjective
    "безличное" -> Just PosAdjective
    "белый" -> Just PosAdjective
    "билет" -> Just PosVerb
    "благодаря" -> Just PosNoun
    "блоки" -> Just PosNoun
    "более" -> Just PosAdjective
    "больной" -> Just PosAdjective
    "больше" -> Just PosAdverb
    "большой" -> Just PosAdjective
    "бот" -> Just PosNoun
    "боюсь" -> Just PosVerb
    "брат" -> Just PosNoun
    "брата" -> Just PosNoun
    "будто" -> Just PosAdverb
    "буду" -> Just PosVerb
    "будущее" -> Just PosAdjective
    "бывает" -> Just PosVerb
    "бык" -> Just PosNoun
    "было" -> Just PosAdverb
    "быстрее" -> Just PosAdjective
    "быстро" -> Just PosAdverb
    "быть" -> Just PosVerb
    "важен" -> Just PosNoun
    "важнее" -> Just PosAdjective
    "важно" -> Just PosAdverb
    "важны" -> Just PosNoun
    "валентность" -> Just PosVerb
    "вариант" -> Just PosNoun
    "ввода" -> Just PosNoun
    "вводит" -> Just PosNoun
    "вводное" -> Just PosAdjective
    "ведь" -> Just PosNoun
    "вера" -> Just PosNoun
    "верно" -> Just PosAdverb
    "вернуть" -> Just PosVerb
    "вероятен" -> Just PosNoun
    "вероятно" -> Just PosAdverb
    "вероятность" -> Just PosVerb
    "весь" -> Just PosNoun
    "вечером" -> Just PosNoun
    "вид" -> Just PosNoun
    "видел" -> Just PosNoun
    "виду" -> Just PosVerb
    "вижу" -> Just PosVerb
    "вин" -> Just PosNoun
    "винительный" -> Just PosAdjective
    "включает" -> Just PosVerb
    "включая" -> Just PosAdjective
    "влияет" -> Just PosVerb
    "вместо" -> Just PosAdverb
    "внутри" -> Just PosNoun
    "во-первых" -> Just PosAdjective
    "вовремя" -> Just PosNoun
    "вода" -> Just PosNoun
    "воды" -> Just PosNoun
    "возвратность" -> Just PosVerb
    "возвращать" -> Just PosVerb
    "возможно" -> Just PosAdverb
    "возможность" -> Just PosVerb
    "возможные" -> Just PosAdjective
    "войти" -> Just PosVerb
    "вон" -> Just PosNoun
    "вообще" -> Just PosAdverb
    "вопрос" -> Just PosNoun
    "вопроса" -> Just PosNoun
    "вопросительная" -> Just PosAdjective
    "вопросительное" -> Just PosAdjective
    "вопросительность" -> Just PosVerb
    "вопросительные" -> Just PosAdjective
    "вопросительный" -> Just PosAdjective
    "вопросом" -> Just PosNoun
    "вопросы" -> Just PosNoun
    "вошел" -> Just PosNoun
    "впрочем" -> Just PosVerb
    "врач" -> Just PosNoun
    "вредно" -> Just PosAdverb
    "времени" -> Just PosNoun
    "временная" -> Just PosAdjective
    "время" -> Just PosNoun
    "вряд" -> Just PosNoun
    "все" -> Just PosAdverb
    "все-таки" -> Just PosNoun
    "всегда" -> Just PosNoun
    "всего" -> Just PosAdverb
    "всех" -> Just PosNoun
    "вследствие" -> Just PosAdjective
    "второй" -> Just PosNumeral
    "входит" -> Just PosNoun
    "входить" -> Just PosVerb
    "вчера" -> Just PosNoun
    "вы" -> Just PosPronoun
    "выбирать" -> Just PosVerb
    "выбрать" -> Just PosVerb
    "вывод" -> Just PosNoun
    "выделять" -> Just PosVerb
    "выполнить" -> Just PosVerb
    "выполнять" -> Just PosVerb
    "выражает" -> Just PosVerb
    "выражается" -> Just PosVerb
    "выражения" -> Just PosNoun
    "высказывание" -> Just PosAdjective
    "высказывания" -> Just PosNoun
    "высокий" -> Just PosAdjective
    "выше" -> Just PosAdverb
    "где" -> Just PosAdverb
    "генерации" -> Just PosNoun
    "генерация" -> Just PosNoun
    "главная" -> Just PosAdjective
    "главное" -> Just PosAdjective
    "главные" -> Just PosAdjective
    "главный" -> Just PosAdjective
    "глагол" -> Just PosNoun
    "глагола" -> Just PosNoun
    "глаголом" -> Just PosNoun
    "глаголы" -> Just PosNoun
    "глагольное" -> Just PosAdjective
    "глагольные" -> Just PosAdjective
    "говори" -> Just PosNoun
    "говорил" -> Just PosVerb
    "говорить" -> Just PosVerb
    "говоря" -> Just PosNoun
    "говорящего" -> Just PosAdverb
    "голубой" -> Just PosAdjective
    "город" -> Just PosNoun
    "готов" -> Just PosNoun
    "готова" -> Just PosNoun
    "готово" -> Just PosAdverb
    "грамматике" -> Just PosAdverb
    "грамматику" -> Just PosVerb
    "грамматически" -> Just PosNoun
    "грамматический" -> Just PosAdjective
    "громко" -> Just PosAdverb
    "громкое" -> Just PosAdjective
    "группа" -> Just PosNoun
    "группу" -> Just PosVerb
    "группы" -> Just PosNoun
    "грустно" -> Just PosAdverb
    "да" -> Just PosNoun
    "давай" -> Just PosNoun
    "дай" -> Just PosNoun
    "данных" -> Just PosAdjective
    "дат" -> Just PosNoun
    "дательный" -> Just PosAdjective
    "дают" -> Just PosVerb
    "два" -> Just PosNumeral
    "двадцать" -> Just PosVerb
    "дверь" -> Just PosNoun
    "движения" -> Just PosNoun
    "двое" -> Just PosAdjective
    "деепричастие" -> Just PosAdjective
    "деепричастный" -> Just PosAdjective
    "дежурный" -> Just PosAdjective
    "дейксис" -> Just PosNoun
    "действие" -> Just PosAdjective
    "действия" -> Just PosNoun
    "делать" -> Just PosVerb
    "день" -> Just PosNoun
    "деревянный" -> Just PosAdjective
    "диалога" -> Just PosNoun
    "диалоге" -> Just PosAdverb
    "дискурсная" -> Just PosAdjective
    "дискурсный" -> Just PosAdjective
    "длинно" -> Just PosAdverb
    "добавить" -> Just PosVerb
    "добавление" -> Just PosAdjective
    "добавляет" -> Just PosVerb
    "добрый" -> Just PosAdjective
    "дождь" -> Just PosNoun
    "дождя" -> Just PosNoun
    "документ" -> Just PosNoun
    "должен" -> Just PosNoun
    "должна" -> Just PosNoun
    "должно" -> Just PosAdverb
    "должны" -> Just PosNoun
    "дом" -> Just PosNoun
    "домов" -> Just PosNoun
    "домой" -> Just PosAdjective
    "дополнение" -> Just PosAdjective
    "дополнения" -> Just PosNoun
    "дополнительные" -> Just PosAdjective
    "достаточно" -> Just PosAdverb
    "доступ" -> Just PosNoun
    "друга" -> Just PosNoun
    "другой" -> Just PosAdjective
    "другу" -> Just PosVerb
    "думать" -> Just PosVerb
    "его" -> Just PosAdverb
    "ед" -> Just PosNoun
    "едва" -> Just PosNoun
    "единиц" -> Just PosNoun
    "единица" -> Just PosNoun
    "ее" -> Just PosAdjective
    "ему" -> Just PosVerb
    "еще" -> Just PosAdverb
    "жаль" -> Just PosNoun
    "ждать" -> Just PosVerb
    "ждет" -> Just PosVerb
    "желательно" -> Just PosAdverb
    "жить" -> Just PosVerb
    "за" -> Just PosNoun
    "заболел" -> Just PosNoun
    "зависимое" -> Just PosAdjective
    "зависимости" -> Just PosVerb
    "зависимость" -> Just PosVerb
    "зависимые" -> Just PosAdjective
    "зависит" -> Just PosNoun
    "завтра" -> Just PosNoun
    "задает" -> Just PosVerb
    "задай" -> Just PosNoun
    "задача" -> Just PosNoun
    "задаче" -> Just PosAdverb
    "задачу" -> Just PosVerb
    "задают" -> Just PosVerb
    "задумался" -> Just PosVerb
    "закрой" -> Just PosAdjective
    "закрыта" -> Just PosNoun
    "закрытый" -> Just PosAdjective
    "заменить" -> Just PosVerb
    "заполнитель" -> Just PosNoun
    "заполняет" -> Just PosVerb
    "запрет" -> Just PosVerb
    "запрос" -> Just PosNoun
    "запускает" -> Just PosVerb
    "запятая" -> Just PosAdjective
    "запятой" -> Just PosAdjective
    "зато" -> Just PosAdverb
    "зачем" -> Just PosAdverb
    "звонил" -> Just PosVerb
    "звука" -> Just PosNoun
    "звукоподражание" -> Just PosAdjective
    "здание" -> Just PosAdjective
    "здесь" -> Just PosNoun
    "здравствуйте" -> Just PosAdverb
    "знает" -> Just PosVerb
    "знаешь" -> Just PosVerb
    "знал" -> Just PosVerb
    "знании" -> Just PosNoun
    "знания" -> Just PosNoun
    "знать" -> Just PosVerb
    "значение" -> Just PosAdjective
    "значения" -> Just PosNoun
    "значит" -> Just PosNoun
    "знаю" -> Just PosVerb
    "иван" -> Just PosNoun
    "идентификация" -> Just PosNoun
    "идет" -> Just PosVerb
    "идея" -> Just PosNoun
    "идти" -> Just PosVerb
    "иду" -> Just PosVerb
    "известно" -> Just PosAdverb
    "извлекать" -> Just PosVerb
    "изменение" -> Just PosAdjective
    "изменяется" -> Just PosVerb
    "изменяются" -> Just PosNoun
    "изоляции" -> Just PosNoun
    "изъяснение" -> Just PosAdjective
    "им" -> Just PosNoun
    "имеет" -> Just PosVerb
    "имеешь" -> Just PosVerb
    "имени" -> Just PosNoun
    "именительного" -> Just PosAdjective
    "именная" -> Just PosAdjective
    "именно" -> Just PosAdverb
    "именной" -> Just PosAdjective
    "иметь" -> Just PosVerb
    "имеют" -> Just PosVerb
    "императив" -> Just PosNoun
    "императивом" -> Just PosNoun
    "императивы" -> Just PosNoun
    "имя" -> Just PosNoun
    "иначе" -> Just PosAdverb
    "инженер" -> Just PosNoun
    "инженерная" -> Just PosAdjective
    "инженерное" -> Just PosAdjective
    "инженерной" -> Just PosAdjective
    "иногда" -> Just PosNoun
    "интересно" -> Just PosAdverb
    "инфинитив" -> Just PosNoun
    "инфинитива" -> Just PosNoun
    "инфинитивы" -> Just PosNoun
    "информацию" -> Just PosVerb
    "исключая" -> Just PosAdjective
    "использовать" -> Just PosVerb
    "исправь" -> Just PosNoun
    "истина" -> Just PosNoun
    "исторически" -> Just PosNoun
    "источник" -> Just PosNoun
    "исходную" -> Just PosVerb
    "исходя" -> Just PosNoun
    "исчезло" -> Just PosAdverb
    "их" -> Just PosNoun
    "ищи" -> Just PosNoun
    "кавычки" -> Just PosNoun
    "каждый" -> Just PosAdjective
    "кажется" -> Just PosVerb
    "казаться" -> Just PosNoun
    "какая" -> Just PosAdjective
    "какие" -> Just PosAdjective
    "какое" -> Just PosAdjective
    "какой" -> Just PosAdjective
    "кандидатов" -> Just PosNoun
    "карта" -> Just PosNoun
    "картошка" -> Just PosNoun
    "категория" -> Just PosNoun
    "качественные" -> Just PosAdjective
    "качество" -> Just PosAdverb
    "класс" -> Just PosNoun
    "классификации" -> Just PosNoun
    "классификация" -> Just PosNoun
    "классифицировать" -> Just PosVerb
    "классов" -> Just PosNoun
    "классы" -> Just PosNoun
    "клауза" -> Just PosNoun
    "клаузы" -> Just PosNoun
    "ключ" -> Just PosNoun
    "ключа" -> Just PosNoun
    "ключи" -> Just PosNoun
    "ключом" -> Just PosNoun
    "книга" -> Just PosNoun
    "книги" -> Just PosNoun
    "книгу" -> Just PosVerb
    "код" -> Just PosNoun
    "количественные" -> Just PosAdjective
    "количество" -> Just PosAdverb
    "команда" -> Just PosNoun
    "команду" -> Just PosVerb
    "команды" -> Just PosNoun
    "комментарий" -> Just PosAdjective
    "комнате" -> Just PosAdverb
    "конечно" -> Just PosAdverb
    "конструкции" -> Just PosNoun
    "конструкция" -> Just PosNoun
    "конструкциях" -> Just PosNoun
    "контакт" -> Just PosNoun
    "контекст" -> Just PosNoun
    "контекста" -> Just PosNoun
    "контекстом" -> Just PosNoun
    "контраст" -> Just PosNoun
    "короткая" -> Just PosAdjective
    "короткие" -> Just PosAdjective
    "короткий" -> Just PosAdjective
    "коротких" -> Just PosNoun
    "коротко" -> Just PosAdverb
    "короче" -> Just PosAdverb
    "коррекция" -> Just PosNoun
    "косвенный" -> Just PosAdjective
    "космос" -> Just PosNoun
    "которая" -> Just PosAdjective
    "которые" -> Just PosAdjective
    "который" -> Just PosAdjective
    "кофе" -> Just PosAdverb
    "кошка" -> Just PosNoun
    "красиво" -> Just PosAdverb
    "красивый" -> Just PosAdjective
    "красный" -> Just PosAdjective
    "краткая" -> Just PosAdjective
    "краткие" -> Just PosAdjective
    "краткий" -> Just PosAdjective
    "краткое" -> Just PosAdjective
    "критические" -> Just PosAdjective
    "критично" -> Just PosAdverb
    "кроме" -> Just PosAdverb
    "кто" -> Just PosPronoun
    "кто-то" -> Just PosAdverb
    "куда" -> Just PosNoun
    "купи" -> Just PosNoun
    "купить" -> Just PosVerb
    "курить" -> Just PosVerb
    "ладно" -> Just PosAdverb
    "лежит" -> Just PosNoun
    "лексические" -> Just PosAdjective
    "летом" -> Just PosNoun
    "лисий" -> Just PosAdjective
    "лица" -> Just PosNoun
    "лицо" -> Just PosAdverb
    "личная" -> Just PosAdjective
    "личные" -> Just PosAdjective
    "лог" -> Just PosNoun
    "логика" -> Just PosNoun
    "лозунг" -> Just PosNoun
    "локализация" -> Just PosNoun
    "локальной" -> Just PosAdjective
    "ломает" -> Just PosVerb
    "ломают" -> Just PosVerb
    "лучше" -> Just PosAdverb
    "люблю" -> Just PosVerb
    "любой" -> Just PosAdjective
    "люди" -> Just PosNoun
    "мало" -> Just PosAdverb
    "мальчик" -> Just PosNoun
    "мама" -> Just PosNoun
    "мамин" -> Just PosNoun
    "маркер" -> Just PosNoun
    "маркеры" -> Just PosNoun
    "маркирует" -> Just PosVerb
    "машинно-полезные" -> Just PosAdjective
    "междометие" -> Just PosAdjective
    "междометия" -> Just PosNoun
    "ментальное" -> Just PosAdjective
    "ментальные" -> Just PosAdjective
    "меньше" -> Just PosAdverb
    "меняет" -> Just PosVerb
    "меняется" -> Just PosVerb
    "меняют" -> Just PosVerb
    "места" -> Just PosNoun
    "место" -> Just PosAdverb
    "местоимение" -> Just PosAdjective
    "местоимений" -> Just PosAdjective
    "местоимения" -> Just PosNoun
    "местоименное" -> Just PosAdjective
    "метро" -> Just PosAdverb
    "минимальная" -> Just PosAdjective
    "минимальные" -> Just PosAdjective
    "минимальный" -> Just PosAdjective
    "минимум" -> Just PosNoun
    "мн" -> Just PosNoun
    "много" -> Just PosAdjective
    "могу" -> Just PosVerb
    "могут" -> Just PosVerb
    "модальность" -> Just PosVerb
    "модальные" -> Just PosAdjective
    "модель" -> Just PosNoun
    "модификатор" -> Just PosNoun
    "модификаторы" -> Just PosNoun
    "модифицирует" -> Just PosVerb
    "может" -> Just PosVerb
    "можешь" -> Just PosVerb
    "можно" -> Just PosAdverb
    "мои" -> Just PosNoun
    "мой" -> Just PosPronoun
    "молоко" -> Just PosAdverb
    "молчать" -> Just PosVerb
    "молчит" -> Just PosNoun
    "море" -> Just PosNoun
    "морфема" -> Just PosNoun
    "морфологические" -> Just PosAdjective
    "морфологический" -> Just PosAdjective
    "морфологию" -> Just PosVerb
    "морфология" -> Just PosNoun
    "москва" -> Just PosNoun
    "мочь" -> Just PosVerb
    "мы" -> Just PosPronoun
    "мысль" -> Just PosNoun
    "мыть" -> Just PosVerb
    "мяу" -> Just PosVerb
    "набор" -> Just PosNoun
    "наверное" -> Just PosAdjective
    "надо" -> Just PosAdverb
    "название" -> Just PosAdjective
    "называет" -> Just PosVerb
    "называется" -> Just PosVerb
    "назывное" -> Just PosAdjective
    "наивного" -> Just PosAdjective
    "найди" -> Just PosNoun
    "найти" -> Just PosVerb
    "наклонение" -> Just PosAdjective
    "наклонения" -> Just PosNoun
    "наличие" -> Just PosAdjective
    "налоги" -> Just PosNoun
    "наоборот" -> Just PosNoun
    "написал" -> Just PosVerb
    "написано" -> Just PosAdverb
    "напиши" -> Just PosNoun
    "направление" -> Just PosAdjective
    "например" -> Just PosNoun
    "напрямую" -> Just PosVerb
    "наречие" -> Just PosAdjective
    "наречием" -> Just PosVerb
    "наречия" -> Just PosNoun
    "наречиями" -> Just PosNoun
    "наречные" -> Just PosAdjective
    "наречный" -> Just PosAdjective
    "настоящее" -> Just PosAdjective
    "настоящем" -> Just PosVerb
    "наука" -> Just PosNoun
    "находится" -> Just PosNoun
    "начал" -> Just PosVerb
    "начале" -> Just PosAdverb
    "начало" -> Just PosAdverb
    "начнем" -> Just PosVerb
    "небо" -> Just PosNoun
    "неверно" -> Just PosAdverb
    "неверный" -> Just PosAdjective
    "неизвестен" -> Just PosNoun
    "неизменяемость" -> Just PosVerb
    "некрасивый" -> Just PosAdjective
    "нельзя" -> Just PosNoun
    "ненавидеть" -> Just PosVerb
    "неоднозначность" -> Just PosVerb
    "неопределенность" -> Just PosVerb
    "непостоянные" -> Just PosAdjective
    "неправильно" -> Just PosAdverb
    "несклоняемые" -> Just PosAdjective
    "несколько" -> Just PosAdverb
    "несмотря" -> Just PosNoun
    "несовершенный" -> Just PosAdjective
    "нет" -> Just PosVerb
    "ниже" -> Just PosAdverb
    "никакой" -> Just PosAdjective
    "никогда" -> Just PosNoun
    "никто" -> Just PosAdverb
    "ничего" -> Just PosAdverb
    "ничто" -> Just PosAdverb
    "новая" -> Just PosAdjective
    "новый" -> Just PosAdjective
    "ножницы" -> Just PosNoun
    "норм" -> Just PosNoun
    "нормально" -> Just PosAdverb
    "нравится" -> Just PosNoun
    "ну" -> Just PosInterjection
    "ну-ка" -> Just PosNoun
    "нужный" -> Just PosAdjective
    "оба" -> Just PosNoun
    "обвиняемый" -> Just PosAdjective
    "обе" -> Just PosAdverb
    "обещал" -> Just PosVerb
    "область" -> Just PosVerb
    "обозначает" -> Just PosVerb
    "обозначающая" -> Just PosAdjective
    "оборот" -> Just PosNoun
    "обрабатывать" -> Just PosVerb
    "обращение" -> Just PosAdjective
    "обращения" -> Just PosNoun
    "обстоятельство" -> Just PosAdverb
    "обстоятельством" -> Just PosNoun
    "обсудить" -> Just PosVerb
    "обсуждать" -> Just PosVerb
    "общая" -> Just PosAdjective
    "общения" -> Just PosNoun
    "объединить" -> Just PosVerb
    "объект" -> Just PosNoun
    "объектом" -> Just PosNoun
    "объекты" -> Just PosNoun
    "объяснения" -> Just PosNoun
    "объясни" -> Just PosNoun
    "объяснить" -> Just PosVerb
    "обычно" -> Just PosAdverb
    "обычное" -> Just PosAdjective
    "обычный" -> Just PosAdjective
    "обычным" -> Just PosNoun
    "обязан" -> Just PosNoun
    "обязательно" -> Just PosAdverb
    "ограничение" -> Just PosAdjective
    "ограничения" -> Just PosNoun
    "один" -> Just PosNumeral
    "одна" -> Just PosNoun
    "однако" -> Just PosAdverb
    "одни" -> Just PosNoun
    "одно" -> Just PosAdverb
    "одновременно" -> Just PosAdverb
    "одного" -> Just PosAdjective
    "одному" -> Just PosVerb
    "однородные" -> Just PosAdjective
    "однословно" -> Just PosAdverb
    "однословное" -> Just PosAdjective
    "ожидание" -> Just PosAdjective
    "озеро" -> Just PosAdverb
    "означает" -> Just PosVerb
    "означать" -> Just PosVerb
    "ой" -> Just PosAdjective
    "оказаться" -> Just PosVerb
    "окна" -> Just PosNoun
    "окно" -> Just PosAdverb
    "окончания" -> Just PosNoun
    "омонимии" -> Just PosNoun
    "омонимия" -> Just PosNoun
    "он" -> Just PosPronoun
    "она" -> Just PosPronoun
    "они" -> Just PosPronoun
    "оно" -> Just PosPronoun
    "оператор" -> Just PosNoun
    "описывает" -> Just PosVerb
    "описываются" -> Just PosNoun
    "опоздал" -> Just PosVerb
    "определение" -> Just PosNoun
    "определитель" -> Just PosNoun
    "определяет" -> Just PosVerb
    "опять" -> Just PosVerb
    "осень" -> Just PosNoun
    "основной" -> Just PosAdjective
    "основные" -> Just PosAdjective
    "особая" -> Just PosAdjective
    "особенно" -> Just PosAdverb
    "особые" -> Just PosAdjective
    "остался" -> Just PosVerb
    "ответ" -> Just PosVerb
    "ответа" -> Just PosNoun
    "ответил" -> Just PosVerb
    "ответить" -> Just PosVerb
    "ответы" -> Just PosNoun
    "отвечает" -> Just PosVerb
    "отвечать" -> Just PosVerb
    "отдельно" -> Just PosAdverb
    "отдельного" -> Just PosAdjective
    "отдельные" -> Just PosAdjective
    "отдельный" -> Just PosAdjective
    "отказ" -> Just PosNoun
    "открой" -> Just PosAdjective
    "открывай" -> Just PosNoun
    "открыл" -> Just PosNoun
    "открыта" -> Just PosNoun
    "открыто" -> Just PosAdverb
    "открыть" -> Just PosVerb
    "откуда" -> Just PosNoun
    "отличается" -> Just PosVerb
    "отличать" -> Just PosVerb
    "отличие" -> Just PosAdjective
    "отложить" -> Just PosVerb
    "относительное" -> Just PosAdjective
    "относится" -> Just PosNoun
    "отношение" -> Just PosAdjective
    "отношении" -> Just PosNoun
    "отношений" -> Just PosAdjective
    "отношения" -> Just PosNoun
    "отождествление" -> Just PosAdjective
    "отправил" -> Just PosVerb
    "отправь" -> Just PosNoun
    "отрицается" -> Just PosVerb
    "отрицание" -> Just PosAdjective
    "отрицания" -> Just PosNoun
    "отрицательная" -> Just PosAdjective
    "отрицательное" -> Just PosAdjective
    "отрицательные" -> Just PosAdjective
    "отрицательный" -> Just PosAdjective
    "отсутствие" -> Just PosAdjective
    "отсутствия" -> Just PosNoun
    "оттенков" -> Just PosNoun
    "отца" -> Just PosNoun
    "отчет" -> Just PosVerb
    "оформи" -> Just PosNoun
    "ох" -> Just PosInterjection
    "оценка" -> Just PosNoun
    "оценку" -> Just PosVerb
    "очень" -> Just PosNoun
    "ошибка" -> Just PosNoun
    "ошибки" -> Just PosNoun
    "ошибся" -> Just PosNoun
    "падеж" -> Just PosNoun
    "падежа" -> Just PosNoun
    "падежам" -> Just PosNoun
    "падеже" -> Just PosAdverb
    "падежи" -> Just PosNoun
    "падежное" -> Just PosAdjective
    "падежом" -> Just PosNoun
    "пальто" -> Just PosAdverb
    "первого" -> Just PosAdjective
    "первый" -> Just PosNumeral
    "переведи" -> Just PosNoun
    "перепиши" -> Just PosNoun
    "переспрос" -> Just PosNoun
    "переформулируй" -> Just PosNoun
    "переход" -> Just PosNoun
    "переходность" -> Just PosVerb
    "печь" -> Just PosVerb
    "писал" -> Just PosVerb
    "письмо" -> Just PosAdverb
    "пиши" -> Just PosNoun
    "пишу" -> Just PosVerb
    "план" -> Just PosNoun
    "плохой" -> Just PosAdjective
    "плюс" -> Just PosNoun
    "по-русски" -> Just PosNoun
    "поболтаем" -> Just PosVerb
    "побуждение" -> Just PosAdjective
    "поведение" -> Just PosAdjective
    "повелительное" -> Just PosAdjective
    "поводу" -> Just PosVerb
    "повтори" -> Just PosNoun
    "повторяющийся" -> Just PosNoun
    "повышает" -> Just PosVerb
    "повышается" -> Just PosVerb
    "поговорить" -> Just PosVerb
    "пограничные" -> Just PosAdjective
    "подлежащего" -> Just PosAdverb
    "подлежащее" -> Just PosAdjective
    "подлежащим" -> Just PosNoun
    "подробнее" -> Just PosAdjective
    "подтверждение" -> Just PosAdjective
    "подтип" -> Just PosNoun
    "подумал" -> Just PosVerb
    "подчинительный" -> Just PosAdjective
    "поезд" -> Just PosNoun
    "пожалуйста" -> Just PosNoun
    "поздно" -> Just PosAdverb
    "позже" -> Just PosAdverb
    "позиции" -> Just PosNoun
    "позиция" -> Just PosNoun
    "пойдем" -> Just PosVerb
    "пойду" -> Just PosVerb
    "пока" -> Just PosNoun
    "покажи" -> Just PosNoun
    "показывай" -> Just PosNoun
    "полезно" -> Just PosAdverb
    "полезны" -> Just PosNoun
    "полисемия" -> Just PosNoun
    "полная" -> Just PosAdjective
    "полное" -> Just PosAdjective
    "полноценный" -> Just PosAdjective
    "положительная" -> Just PosAdjective
    "получает" -> Just PosVerb
    "пользователь" -> Just PosNoun
    "помечать" -> Just PosVerb
    "помнить" -> Just PosVerb
    "помнишь" -> Just PosNoun
    "помог" -> Just PosNoun
    "помогает" -> Just PosVerb
    "помоги" -> Just PosNoun
    "помочь" -> Just PosVerb
    "понимания" -> Just PosNoun
    "понимать" -> Just PosVerb
    "понимаю" -> Just PosVerb
    "понял" -> Just PosNoun
    "понятно" -> Just PosAdverb
    "пора" -> Just PosNoun
    "порядковое" -> Just PosAdjective
    "порядковые" -> Just PosAdjective
    "порядок" -> Just PosNoun
    "после" -> Just PosAdverb
    "посмотрел" -> Just PosNoun
    "постоянные" -> Just PosAdjective
    "построен" -> Just PosNoun
    "построили" -> Just PosVerb
    "построить" -> Just PosVerb
    "потом" -> Just PosNoun
    "похоже" -> Just PosAdverb
    "почему" -> Just PosAdverb
    "почитать" -> Just PosVerb
    "почти" -> Just PosVerb
    "пошел" -> Just PosNoun
    "поэтому" -> Just PosVerb
    "поясни" -> Just PosNoun
    "прав" -> Just PosNoun
    "правда" -> Just PosNoun
    "правила" -> Just PosVerb
    "правило" -> Just PosAdverb
    "правильно" -> Just PosAdverb
    "предикат" -> Just PosNoun
    "предикате" -> Just PosAdverb
    "предикатив" -> Just PosNoun
    "предикатом" -> Just PosNoun
    "предл" -> Just PosNoun
    "предлог" -> Just PosNoun
    "предлога" -> Just PosNoun
    "предлоги" -> Just PosNoun
    "предложение" -> Just PosAdjective
    "предложении" -> Just PosNoun
    "предложения" -> Just PosNoun
    "предложный" -> Just PosAdjective
    "предмет" -> Just PosVerb
    "предмета" -> Just PosNoun
    "предупреждение" -> Just PosAdjective
    "предыдущего" -> Just PosAdverb
    "привет" -> Just PosVerb
    "приводит" -> Just PosNoun
    "приглашение" -> Just PosAdjective
    "придаточного" -> Just PosAdjective
    "придаточное" -> Just PosAdjective
    "придет" -> Just PosVerb
    "придумай" -> Just PosNoun
    "признак" -> Just PosNoun
    "признака" -> Just PosNoun
    "признаки" -> Just PosNoun
    "прийти" -> Just PosVerb
    "прикрепляется" -> Just PosVerb
    "прилагательного" -> Just PosAdjective
    "прилагательное" -> Just PosAdjective
    "прилагательные" -> Just PosAdjective
    "прилагательным" -> Just PosNoun
    "пример" -> Just PosNoun
    "примерно" -> Just PosAdverb
    "примеры" -> Just PosNoun
    "принадлежность" -> Just PosVerb
    "принцип" -> Just PosNoun
    "притяжательное" -> Just PosAdjective
    "причастие" -> Just PosAdjective
    "причастия" -> Just PosNoun
    "причастный" -> Just PosAdjective
    "причастных" -> Just PosAdjective
    "причина" -> Just PosNoun
    "причинность" -> Just PosVerb
    "причины" -> Just PosNoun
    "пришел" -> Just PosNoun
    "проблема" -> Just PosNoun
    "проверил" -> Just PosVerb
    "проверить" -> Just PosVerb
    "проверка" -> Just PosNoun
    "проверь" -> Just PosNoun
    "проверять" -> Just PosVerb
    "продолжение" -> Just PosAdjective
    "производные" -> Just PosAdjective
    "производный" -> Just PosAdjective
    "происходит" -> Just PosNoun
    "просит" -> Just PosNoun
    "просто" -> Just PosAdverb
    "простой" -> Just PosAdjective
    "пространство" -> Just PosAdverb
    "просьба" -> Just PosNoun
    "просьбы" -> Just PosNoun
    "противительный" -> Just PosAdjective
    "противопоставление" -> Just PosAdjective
    "прочитав" -> Just PosNoun
    "прочитай" -> Just PosNoun
    "прочитал" -> Just PosVerb
    "прочитанная" -> Just PosAdjective
    "прочитанный" -> Just PosAdjective
    "прошедшего" -> Just PosAdverb
    "прошедшее" -> Just PosAdjective
    "проще" -> Just PosAdverb
    "прямо" -> Just PosAdverb
    "пунктуацию" -> Just PosVerb
    "пунктуация" -> Just PosNoun
    "путать" -> Just PosVerb
    "путь" -> Just PosVerb
    "пушкин" -> Just PosNoun
    "пяти" -> Just PosVerb
    "пять" -> Just PosNumeral
    "работает" -> Just PosVerb
    "работать" -> Just PosVerb
    "рабочий" -> Just PosAdjective
    "рабочими" -> Just PosNoun
    "равно" -> Just PosAdverb
    "рад" -> Just PosNoun
    "рада" -> Just PosNoun
    "ради" -> Just PosNoun
    "радость" -> Just PosVerb
    "раз" -> Just PosNoun
    "разбор" -> Just PosNoun
    "разговорные" -> Just PosAdjective
    "разговорный" -> Just PosAdjective
    "разговору" -> Just PosVerb
    "раздалось" -> Just PosVerb
    "раздельное" -> Just PosAdjective
    "различать" -> Just PosVerb
    "различие" -> Just PosAdjective
    "разные" -> Just PosAdjective
    "разных" -> Just PosAdjective
    "разряд" -> Just PosNoun
    "разу" -> Just PosVerb
    "рамочные" -> Just PosAdjective
    "рано" -> Just PosAdverb
    "раньше" -> Just PosAdverb
    "распознавания" -> Just PosNoun
    "распознавать" -> Just PosVerb
    "расскажи" -> Just PosNoun
    "реакции" -> Just PosNoun
    "реакция" -> Just PosNoun
    "реализации" -> Just PosNoun
    "ребенок" -> Just PosNoun
    "редко" -> Just PosAdverb
    "река" -> Just PosNoun
    "реки" -> Just PosNoun
    "рекомендация" -> Just PosNoun
    "рекомендуемый" -> Just PosAdjective
    "реплик" -> Just PosNoun
    "реплика" -> Just PosNoun
    "реплики" -> Just PosNoun
    "репликой" -> Just PosAdjective
    "референт" -> Just PosNoun
    "речевой" -> Just PosAdjective
    "речевые" -> Just PosAdjective
    "речи" -> Just PosNoun
    "решение" -> Just PosAdjective
    "решить" -> Just PosVerb
    "ровно" -> Just PosAdverb
    "род" -> Just PosNoun
    "рода" -> Just PosNoun
    "родительный" -> Just PosAdjective
    "роли" -> Just PosNoun
    "роль" -> Just PosNoun
    "руки" -> Just PosNoun
    "русская" -> Just PosAdjective
    "русский" -> Just PosAdjective
    "русских" -> Just PosNoun
    "русского" -> Just PosAdjective
    "русском" -> Just PosNoun
    "ручкой" -> Just PosAdjective
    "рядом" -> Just PosNoun
    "сайт" -> Just PosNoun
    "сам" -> Just PosNoun
    "самое" -> Just PosAdjective
    "самостоятельная" -> Just PosAdjective
    "самостоятельный" -> Just PosAdjective
    "самый" -> Just PosAdjective
    "сбой" -> Just PosAdjective
    "сборка" -> Just PosNoun
    "свет" -> Just PosVerb
    "свобода" -> Just PosNoun
    "свой" -> Just PosAdjective
    "связан" -> Just PosNoun
    "связи" -> Just PosNoun
    "связка" -> Just PosNoun
    "связочные" -> Just PosAdjective
    "связочный" -> Just PosAdjective
    "связывает" -> Just PosVerb
    "связь" -> Just PosNoun
    "сгенерируй" -> Just PosNoun
    "сделай" -> Just PosNoun
    "сделал" -> Just PosVerb
    "сделать" -> Just PosVerb
    "себе" -> Just PosAdverb
    "себя" -> Just PosPronoun
    "сегодня" -> Just PosNoun
    "сейчас" -> Just PosNoun
    "семантика" -> Just PosNoun
    "семантическая" -> Just PosAdjective
    "семантические" -> Just PosAdjective
    "семантической" -> Just PosAdjective
    "сервер" -> Just PosNoun
    "сестре" -> Just PosAdverb
    "сигнал" -> Just PosVerb
    "силен" -> Just PosNoun
    "синтаксис" -> Just PosNoun
    "синтаксическая" -> Just PosAdjective
    "синтаксически" -> Just PosNoun
    "синтаксические" -> Just PosAdjective
    "синтаксический" -> Just PosAdjective
    "синтаксической" -> Just PosAdjective
    "синтаксическую" -> Just PosVerb
    "синхронно" -> Just PosAdverb
    "система" -> Just PosNoun
    "системе" -> Just PosAdverb
    "системы" -> Just PosNoun
    "ситуации" -> Just PosNoun
    "скажи" -> Just PosNoun
    "скажи-ка" -> Just PosNoun
    "сказал" -> Just PosVerb
    "сказать" -> Just PosVerb
    "сказуемого" -> Just PosAdjective
    "сказуемое" -> Just PosAdjective
    "сказуемым" -> Just PosNoun
    "склонение" -> Just PosAdjective
    "сколько" -> Just PosAdverb
    "скрываться" -> Just PosVerb
    "скучно" -> Just PosAdverb
    "слева" -> Just PosNoun
    "следовательно" -> Just PosAdverb
    "следствие" -> Just PosAdjective
    "слитное" -> Just PosAdjective
    "слишком" -> Just PosNoun
    "слов" -> Just PosNoun
    "слова" -> Just PosNoun
    "словам" -> Just PosNoun
    "словарь" -> Just PosNoun
    "словно" -> Just PosAdverb
    "слово" -> Just PosAdverb
    "словом" -> Just PosNoun
    "словоформа" -> Just PosNoun
    "слову" -> Just PosVerb
    "сложного" -> Just PosAdjective
    "слой" -> Just PosAdjective
    "служебная" -> Just PosAdjective
    "служебные" -> Just PosAdjective
    "случаи" -> Just PosNoun
    "случай" -> Just PosNoun
    "случилось" -> Just PosNoun
    "слушай" -> Just PosNoun
    "слышишь" -> Just PosNoun
    "смотря" -> Just PosNoun
    "смысл" -> Just PosNoun
    "смягчение" -> Just PosAdjective
    "сначала" -> Just PosVerb
    "снег" -> Just PosNoun
    "снега" -> Just PosNoun
    "собака" -> Just PosNoun
    "собирательное" -> Just PosAdjective
    "собственное" -> Just PosAdjective
    "событие" -> Just PosAdjective
    "события" -> Just PosNoun
    "совершенный" -> Just PosAdjective
    "совсем" -> Just PosVerb
    "согласие" -> Just PosAdjective
    "согласиться" -> Just PosNoun
    "согласно" -> Just PosAdverb
    "согласование" -> Just PosAdjective
    "согласования" -> Just PosNoun
    "согласуется" -> Just PosVerb
    "содержание" -> Just PosAdjective
    "содержит" -> Just PosNoun
    "соединяет" -> Just PosVerb
    "создай" -> Just PosNoun
    "создать" -> Just PosVerb
    "сократи" -> Just PosVerb
    "сомневаюсь" -> Just PosVerb
    "сомнение" -> Just PosAdjective
    "сон" -> Just PosNoun
    "сообщение" -> Just PosAdjective
    "составе" -> Just PosAdverb
    "составной" -> Just PosAdjective
    "составные" -> Just PosAdjective
    "составь" -> Just PosNoun
    "состоит" -> Just PosNoun
    "состояние" -> Just PosAdjective
    "состояния" -> Just PosNoun
    "сохранить" -> Just PosVerb
    "сохранять" -> Just PosVerb
    "социальная" -> Just PosAdjective
    "сочетание" -> Just PosAdjective
    "сочинение" -> Just PosAdjective
    "союз" -> Just PosNoun
    "союза" -> Just PosNoun
    "союзное" -> Just PosAdjective
    "союзов" -> Just PosNoun
    "союзом" -> Just PosNoun
    "союзы" -> Just PosNoun
    "спал" -> Just PosVerb
    "спасибо" -> Just PosAdverb
    "спать" -> Just PosVerb
    "списки" -> Just PosNoun
    "список" -> Just PosNoun
    "спит" -> Just PosNoun
    "спокойно" -> Just PosAdverb
    "спорить" -> Just PosVerb
    "способ" -> Just PosNoun
    "способе" -> Just PosAdverb
    "справа" -> Just PosNoun
    "спросил" -> Just PosVerb
    "спросить" -> Just PosVerb
    "ср" -> Just PosNoun
    "сравнение" -> Just PosAdjective
    "сравнения" -> Just PosNoun
    "сравни" -> Just PosNoun
    "сравнительная" -> Just PosAdjective
    "сравнительный" -> Just PosAdjective
    "сразу" -> Just PosVerb
    "стал" -> Just PosVerb
    "стали" -> Just PosVerb
    "становилось" -> Just PosNoun
    "старший" -> Just PosAdjective
    "старый" -> Just PosAdjective
    "статус" -> Just PosNoun
    "стать" -> Just PosVerb
    "стемнело" -> Just PosAdverb
    "степени" -> Just PosNoun
    "степень" -> Just PosNoun
    "сто" -> Just PosNumeral
    "стоит" -> Just PosNoun
    "стол" -> Just PosNoun
    "столовая" -> Just PosAdjective
    "столько" -> Just PosAdverb
    "стоп" -> Just PosNoun
    "сторонам" -> Just PosNoun
    "страдательное" -> Just PosAdjective
    "странно" -> Just PosAdverb
    "страшно" -> Just PosAdverb
    "строительство" -> Just PosAdverb
    "строить" -> Just PosVerb
    "строка" -> Just PosNoun
    "структура" -> Just PosNoun
    "структуры" -> Just PosNoun
    "субстантивации" -> Just PosNoun
    "субстантивацию" -> Just PosVerb
    "субстантивация" -> Just PosNoun
    "субстантивированное" -> Just PosAdjective
    "субъект" -> Just PosNoun
    "субъектность" -> Just PosNoun
    "суффиксы" -> Just PosNoun
    "существительного" -> Just PosAdjective
    "существительное" -> Just PosAdjective
    "существительные" -> Just PosAdjective
    "существительным" -> Just PosNoun
    "существительных" -> Just PosAdjective
    "существование" -> Just PosAdjective
    "схема" -> Just PosNoun
    "считать" -> Just PosVerb
    "сюда" -> Just PosNoun
    "таблица" -> Just PosNoun
    "таблицу" -> Just PosVerb
    "так" -> Just PosNoun
    "также" -> Just PosAdverb
    "такой" -> Just PosPronoun
    "такси" -> Just PosNoun
    "там" -> Just PosNoun
    "твор" -> Just PosNoun
    "творительный" -> Just PosAdjective
    "тег" -> Just PosNoun
    "текст" -> Just PosNoun
    "текста" -> Just PosNoun
    "телефон" -> Just PosNoun
    "тем" -> Just PosVerb
    "тема" -> Just PosNoun
    "темнее" -> Just PosAdjective
    "темно" -> Just PosAdverb
    "тему" -> Just PosVerb
    "темы" -> Just PosNoun
    "теперь" -> Just PosNoun
    "тепло" -> Just PosAdverb
    "тесты" -> Just PosNoun
    "течение" -> Just PosAdjective
    "тип" -> Just PosNoun
    "типа" -> Just PosNoun
    "типичные" -> Just PosAdjective
    "типовые" -> Just PosAdjective
    "типы" -> Just PosNoun
    "тире" -> Just PosAdverb
    "тихо" -> Just PosAdverb
    "тише" -> Just PosAdverb
    "тишина" -> Just PosNoun
    "то" -> Just PosAdverb
    "того" -> Just PosAdjective
    "тоже" -> Just PosAdverb
    "токен" -> Just PosNoun
    "токена" -> Just PosNoun
    "токены" -> Just PosNoun
    "тот" -> Just PosNoun
    "требование" -> Just PosAdjective
    "требует" -> Just PosVerb
    "требуют" -> Just PosVerb
    "три" -> Just PosNumeral
    "трудно" -> Just PosAdverb
    "туда" -> Just PosNoun
    "тут" -> Just PosVerb
    "ты" -> Just PosPronoun
    "уверен" -> Just PosNoun
    "уверенно" -> Just PosAdverb
    "уверенность" -> Just PosVerb
    "увы" -> Just PosInterjection
    "удали" -> Just PosVerb
    "удалить" -> Just PosVerb
    "удаляй" -> Just PosNoun
    "удивительно" -> Just PosAdverb
    "уж" -> Just PosNoun
    "уже" -> Just PosAdverb
    "узкий" -> Just PosAdjective
    "уйти" -> Just PosVerb
    "указание" -> Just PosAdjective
    "указательное" -> Just PosAdjective
    "указывает" -> Just PosVerb
    "улице" -> Just PosAdverb
    "улучши" -> Just PosNoun
    "улыбаться" -> Just PosNoun
    "улыбаясь" -> Just PosNoun
    "упала" -> Just PosVerb
    "употребление" -> Just PosAdjective
    "управление" -> Just PosAdjective
    "ура" -> Just PosNoun
    "уровне" -> Just PosAdverb
    "урока" -> Just PosNoun
    "усиление" -> Just PosAdjective
    "усиления" -> Just PosNoun
    "усиливает" -> Just PosVerb
    "усилитель" -> Just PosNoun
    "усилительная" -> Just PosAdjective
    "усилительное" -> Just PosAdjective
    "условие" -> Just PosAdjective
    "условии" -> Just PosNoun
    "условного" -> Just PosAdjective
    "условное" -> Just PosAdjective
    "условном" -> Just PosNoun
    "устал" -> Just PosVerb
    "устойчивые" -> Just PosAdjective
    "уточнение" -> Just PosAdjective
    "уточнить" -> Just PosVerb
    "уточняющий" -> Just PosAdjective
    "утром" -> Just PosNoun
    "участник" -> Just PosNoun
    "участников" -> Just PosNoun
    "учащийся" -> Just PosNoun
    "учитель" -> Just PosNoun
    "учителя" -> Just PosNoun
    "учитывать" -> Just PosVerb
    "учреждение" -> Just PosAdjective
    "ушел" -> Just PosNoun
    "ушли" -> Just PosNoun
    "файл" -> Just PosNoun
    "фильм" -> Just PosNoun
    "фокус" -> Just PosNoun
    "форм" -> Just PosNoun
    "форма" -> Just PosNoun
    "формат" -> Just PosNoun
    "форме" -> Just PosAdverb
    "формой" -> Just PosAdjective
    "формообразующая" -> Just PosAdjective
    "форму" -> Just PosVerb
    "формулы" -> Just PosNoun
    "формы" -> Just PosNoun
    "фотосинтез" -> Just PosNoun
    "фрагмент" -> Just PosNoun
    "фрагменты" -> Just PosNoun
    "фу" -> Just PosVerb
    "функция" -> Just PosNoun
    "хватит" -> Just PosNoun
    "хлеб" -> Just PosNoun
    "холодно" -> Just PosAdverb
    "хороший" -> Just PosAdjective
    "хорошо" -> Just PosAdverb
    "хотел" -> Just PosNoun
    "хотеть" -> Just PosVerb
    "хочу" -> Just PosVerb
    "хранить" -> Just PosVerb
    "хуже" -> Just PosAdverb
    "цели" -> Just PosNoun
    "цель" -> Just PosNoun
    "целью" -> Just PosVerb
    "центр" -> Just PosNoun
    "чай" -> Just PosNoun
    "час" -> Just PosNoun
    "частей" -> Just PosNoun
    "части" -> Just PosVerb
    "частица" -> Just PosNoun
    "частицу" -> Just PosVerb
    "частицы" -> Just PosNoun
    "частично" -> Just PosAdverb
    "часто" -> Just PosAdverb
    "часть" -> Just PosVerb
    "чате" -> Just PosAdverb
    "чаще" -> Just PosAdverb
    "че" -> Just PosAdverb
    "чей" -> Just PosNoun
    "человек" -> Just PosNoun
    "четыре" -> Just PosNumeral
    "числа" -> Just PosNoun
    "числительного" -> Just PosAdjective
    "числительное" -> Just PosAdjective
    "числительные" -> Just PosAdjective
    "число" -> Just PosAdverb
    "читает" -> Just PosVerb
    "читать" -> Just PosVerb
    "читаю" -> Just PosVerb
    "читающий" -> Just PosAdjective
    "читая" -> Just PosAdjective
    "член" -> Just PosNoun
    "членами" -> Just PosNoun
    "членом" -> Just PosNoun
    "члены" -> Just PosNoun
    "чтение" -> Just PosAdjective
    "что" -> Just PosPronoun
    "что-нибудь" -> Just PosNoun
    "что-то" -> Just PosAdverb
    "шел" -> Just PosNoun
    "школа" -> Just PosNoun
    "школу" -> Just PosVerb
    "школьная" -> Just PosAdjective
    "школьного" -> Just PosAdjective
    "школьной" -> Just PosAdjective
    "школьный" -> Just PosAdjective
    "шум" -> Just PosNoun
    "эвристики" -> Just PosNoun
    "эй" -> Just PosInterjection
    "экспрессия" -> Just PosNoun
    "элемент" -> Just PosNoun
    "эллипсис" -> Just PosNoun
    "эмоциональная" -> Just PosAdjective
    "эта" -> Just PosPronoun
    "этикетные" -> Just PosAdjective
    "это" -> Just PosPronoun
    "этот" -> Just PosPronoun
    "эту" -> Just PosVerb
    "эх" -> Just PosNoun
    "я" -> Just PosPronoun
    "явление" -> Just PosNoun
    "являться" -> Just PosVerb
    "явно" -> Just PosAdverb
    "явного" -> Just PosAdjective
    "ядра" -> Just PosNoun
    "ядро" -> Just PosAdverb
    _ -> Nothing

generatedLemmaToSem :: Text -> [InputSemanticClass]
generatedLemmaToSem t = case t of
    "абстрактное" -> [SemState]
    "автоматически" -> [SemUnknown]
    "автором" -> [SemUnknown]
    "ага" -> [SemUnknown]
    "адресат" -> [SemUnknown]
    "алло" -> [SemState]
    "анализ" -> [SemUnknown]
    "анализа" -> [SemUnknown]
    "ах" -> [SemUnknown]
    "базового" -> [SemState]
    "базовые" -> [SemState]
    "бах" -> [SemUnknown]
    "безличная" -> [SemState]
    "безличное" -> [SemState]
    "белый" -> [SemState]
    "билет" -> [SemAction]
    "благодаря" -> [SemUnknown]
    "блоки" -> [SemUnknown]
    "более" -> [SemState]
    "больной" -> [SemState]
    "больше" -> [SemState]
    "большой" -> [SemState]
    "бот" -> [SemUnknown]
    "боюсь" -> [SemAction]
    "брат" -> [SemUnknown]
    "брата" -> [SemUnknown]
    "будто" -> [SemState]
    "буду" -> [SemAction]
    "будущее" -> [SemState]
    "бывает" -> [SemAction]
    "бык" -> [SemUnknown]
    "было" -> [SemState]
    "быстрее" -> [SemState]
    "быстро" -> [SemState]
    "быть" -> [SemAction, SemIdentity, SemState]
    "важен" -> [SemUnknown]
    "важнее" -> [SemState]
    "важно" -> [SemState]
    "важны" -> [SemUnknown]
    "валентность" -> [SemAction]
    "вариант" -> [SemUnknown]
    "ввода" -> [SemUnknown]
    "вводит" -> [SemUnknown]
    "вводное" -> [SemState]
    "ведь" -> [SemUnknown]
    "вера" -> [SemUnknown]
    "верно" -> [SemState]
    "вернуть" -> [SemAction]
    "вероятен" -> [SemUnknown]
    "вероятно" -> [SemState]
    "вероятность" -> [SemAction]
    "весь" -> [SemUnknown]
    "вечером" -> [SemUnknown]
    "вид" -> [SemUnknown]
    "видел" -> [SemUnknown]
    "виду" -> [SemAction]
    "вижу" -> [SemAction]
    "вин" -> [SemUnknown]
    "винительный" -> [SemState]
    "включает" -> [SemAction]
    "включая" -> [SemState]
    "влияет" -> [SemAction]
    "вместо" -> [SemState]
    "внутри" -> [SemUnknown]
    "во-первых" -> [SemState]
    "вовремя" -> [SemUnknown]
    "вода" -> [SemUnknown]
    "воды" -> [SemUnknown]
    "возвратность" -> [SemAction]
    "возвращать" -> [SemAction]
    "возможно" -> [SemState]
    "возможность" -> [SemAction]
    "возможные" -> [SemState]
    "войти" -> [SemAction]
    "вон" -> [SemUnknown]
    "вообще" -> [SemState]
    "вопрос" -> [SemUnknown]
    "вопроса" -> [SemUnknown]
    "вопросительная" -> [SemState]
    "вопросительное" -> [SemState]
    "вопросительность" -> [SemAction]
    "вопросительные" -> [SemState]
    "вопросительный" -> [SemState]
    "вопросом" -> [SemUnknown]
    "вопросы" -> [SemUnknown]
    "вошел" -> [SemUnknown]
    "впрочем" -> [SemAction]
    "врач" -> [SemUnknown]
    "вредно" -> [SemState]
    "времени" -> [SemUnknown]
    "временная" -> [SemState]
    "время" -> [SemContemplative]
    "вряд" -> [SemUnknown]
    "все" -> [SemState]
    "все-таки" -> [SemUnknown]
    "всегда" -> [SemUnknown]
    "всего" -> [SemState]
    "всех" -> [SemUnknown]
    "вследствие" -> [SemState]
    "второй" -> [SemUnknown]
    "входит" -> [SemUnknown]
    "входить" -> [SemAction]
    "вчера" -> [SemUnknown]
    "вы" -> [SemUserReference]
    "выбирать" -> [SemAction]
    "выбрать" -> [SemAction]
    "вывод" -> [SemUnknown]
    "выделять" -> [SemAction]
    "выполнить" -> [SemAction]
    "выполнять" -> [SemAction]
    "выражает" -> [SemAction]
    "выражается" -> [SemAction]
    "выражения" -> [SemUnknown]
    "высказывание" -> [SemState]
    "высказывания" -> [SemUnknown]
    "высокий" -> [SemState]
    "выше" -> [SemState]
    "где" -> [SemState, SemUnknown]
    "генерации" -> [SemUnknown]
    "генерация" -> [SemUnknown]
    "главная" -> [SemState]
    "главное" -> [SemState]
    "главные" -> [SemState]
    "главный" -> [SemState]
    "глагол" -> [SemUnknown]
    "глагола" -> [SemUnknown]
    "глаголом" -> [SemUnknown]
    "глаголы" -> [SemUnknown]
    "глагольное" -> [SemState]
    "глагольные" -> [SemState]
    "говори" -> [SemUnknown]
    "говорил" -> [SemAction]
    "говорить" -> [SemAction]
    "говоря" -> [SemUnknown]
    "говорящего" -> [SemState]
    "голубой" -> [SemQualityProperty]
    "город" -> [SemWorldObject]
    "готов" -> [SemUnknown]
    "готова" -> [SemUnknown]
    "готово" -> [SemState]
    "грамматике" -> [SemState]
    "грамматику" -> [SemAction]
    "грамматически" -> [SemUnknown]
    "грамматический" -> [SemState]
    "громко" -> [SemState]
    "громкое" -> [SemState]
    "группа" -> [SemUnknown]
    "группу" -> [SemAction]
    "группы" -> [SemUnknown]
    "грустно" -> [SemState]
    "да" -> [SemUnknown]
    "давай" -> [SemDialogueInvitation]
    "дай" -> [SemUnknown]
    "данных" -> [SemState]
    "дат" -> [SemUnknown]
    "дательный" -> [SemState]
    "дают" -> [SemAction]
    "два" -> [SemUnknown]
    "двадцать" -> [SemAction]
    "дверь" -> [SemUnknown]
    "движения" -> [SemUnknown]
    "двое" -> [SemState]
    "деепричастие" -> [SemState]
    "деепричастный" -> [SemState]
    "дежурный" -> [SemState]
    "дейксис" -> [SemUnknown]
    "действие" -> [SemState]
    "действия" -> [SemUnknown]
    "делать" -> [SemAction]
    "день" -> [SemUnknown]
    "деревянный" -> [SemState]
    "диалога" -> [SemUnknown]
    "диалоге" -> [SemState]
    "дискурсная" -> [SemState]
    "дискурсный" -> [SemState]
    "длинно" -> [SemState]
    "добавить" -> [SemAction]
    "добавление" -> [SemState]
    "добавляет" -> [SemAction]
    "добрый" -> [SemState]
    "дождь" -> [SemWorldPhenomenon]
    "дождя" -> [SemUnknown]
    "документ" -> [SemUnknown]
    "должен" -> [SemUnknown]
    "должна" -> [SemUnknown]
    "должно" -> [SemState]
    "должны" -> [SemUnknown]
    "дом" -> [SemContemplative, SemPhysicalObject, SemWorldObject]
    "домов" -> [SemUnknown]
    "домой" -> [SemState]
    "дополнение" -> [SemState]
    "дополнения" -> [SemUnknown]
    "дополнительные" -> [SemState]
    "достаточно" -> [SemState]
    "доступ" -> [SemUnknown]
    "друга" -> [SemUnknown]
    "другой" -> [SemState]
    "другу" -> [SemAction]
    "думать" -> [SemAction]
    "его" -> [SemState]
    "ед" -> [SemUnknown]
    "едва" -> [SemUnknown]
    "единиц" -> [SemUnknown]
    "единица" -> [SemUnknown]
    "ее" -> [SemState]
    "ему" -> [SemAction]
    "еще" -> [SemState]
    "жаль" -> [SemUnknown]
    "ждать" -> [SemAction]
    "ждет" -> [SemAction]
    "желательно" -> [SemState]
    "жить" -> [SemAction]
    "за" -> [SemUnknown]
    "заболел" -> [SemUnknown]
    "зависимое" -> [SemState]
    "зависимости" -> [SemAction]
    "зависимость" -> [SemAction]
    "зависимые" -> [SemState]
    "зависит" -> [SemUnknown]
    "завтра" -> [SemUnknown]
    "задает" -> [SemAction]
    "задай" -> [SemUnknown]
    "задача" -> [SemUnknown]
    "задаче" -> [SemState]
    "задачу" -> [SemAction]
    "задают" -> [SemAction]
    "задумался" -> [SemAction]
    "закрой" -> [SemState]
    "закрыта" -> [SemUnknown]
    "закрытый" -> [SemState]
    "заменить" -> [SemAction]
    "заполнитель" -> [SemUnknown]
    "заполняет" -> [SemAction]
    "запрет" -> [SemAction]
    "запрос" -> [SemUnknown]
    "запускает" -> [SemAction]
    "запятая" -> [SemState]
    "запятой" -> [SemState]
    "зато" -> [SemState]
    "зачем" -> [SemPurposeFunction, SemState]
    "звонил" -> [SemAction]
    "звука" -> [SemUnknown]
    "звукоподражание" -> [SemState]
    "здание" -> [SemState]
    "здесь" -> [SemUnknown]
    "здравствуйте" -> [SemState]
    "знает" -> [SemAction]
    "знаешь" -> [SemAction]
    "знал" -> [SemAction]
    "знании" -> [SemUnknown]
    "знания" -> [SemUnknown]
    "знать" -> [SemAction, SemKnowledge]
    "значение" -> [SemState]
    "значения" -> [SemUnknown]
    "значит" -> [SemUnknown]
    "знаю" -> [SemAction]
    "иван" -> [SemUnknown]
    "идентификация" -> [SemUnknown]
    "идет" -> [SemAction]
    "идея" -> [SemMentalObject]
    "идти" -> [SemAction]
    "иду" -> [SemAction]
    "известно" -> [SemKnowledge, SemState]
    "извлекать" -> [SemAction]
    "изменение" -> [SemState]
    "изменяется" -> [SemAction]
    "изменяются" -> [SemUnknown]
    "изоляции" -> [SemUnknown]
    "изъяснение" -> [SemState]
    "им" -> [SemUnknown]
    "имеет" -> [SemAction]
    "имеешь" -> [SemAction]
    "имени" -> [SemUnknown]
    "именительного" -> [SemState]
    "именная" -> [SemState]
    "именно" -> [SemState]
    "именной" -> [SemState]
    "иметь" -> [SemAction]
    "имеют" -> [SemAction]
    "императив" -> [SemUnknown]
    "императивом" -> [SemUnknown]
    "императивы" -> [SemUnknown]
    "имя" -> [SemUnknown]
    "иначе" -> [SemState]
    "инженер" -> [SemUnknown]
    "инженерная" -> [SemState]
    "инженерное" -> [SemState]
    "инженерной" -> [SemState]
    "иногда" -> [SemUnknown]
    "интересно" -> [SemState]
    "инфинитив" -> [SemUnknown]
    "инфинитива" -> [SemUnknown]
    "инфинитивы" -> [SemUnknown]
    "информацию" -> [SemAction]
    "исключая" -> [SemState]
    "использовать" -> [SemAction]
    "исправь" -> [SemUnknown]
    "истина" -> [SemAbstractConcept, SemContemplative]
    "исторически" -> [SemUnknown]
    "источник" -> [SemUnknown]
    "исходную" -> [SemAction]
    "исходя" -> [SemUnknown]
    "исчезло" -> [SemState]
    "их" -> [SemUnknown]
    "ищи" -> [SemUnknown]
    "кавычки" -> [SemUnknown]
    "каждый" -> [SemState]
    "кажется" -> [SemAction]
    "казаться" -> [SemUnknown]
    "какая" -> [SemState]
    "какие" -> [SemState]
    "какое" -> [SemState]
    "какой" -> [SemState]
    "кандидатов" -> [SemUnknown]
    "карта" -> [SemUnknown]
    "картошка" -> [SemUnknown]
    "категория" -> [SemUnknown]
    "качественные" -> [SemState]
    "качество" -> [SemState]
    "класс" -> [SemUnknown]
    "классификации" -> [SemUnknown]
    "классификация" -> [SemUnknown]
    "классифицировать" -> [SemAction]
    "классов" -> [SemUnknown]
    "классы" -> [SemUnknown]
    "клауза" -> [SemUnknown]
    "клаузы" -> [SemUnknown]
    "ключ" -> [SemUnknown]
    "ключа" -> [SemUnknown]
    "ключи" -> [SemUnknown]
    "ключом" -> [SemUnknown]
    "книга" -> [SemUnknown]
    "книги" -> [SemUnknown]
    "книгу" -> [SemAction]
    "код" -> [SemUnknown]
    "количественные" -> [SemState]
    "количество" -> [SemState]
    "команда" -> [SemUnknown]
    "команду" -> [SemAction]
    "команды" -> [SemUnknown]
    "комментарий" -> [SemState]
    "комнате" -> [SemState]
    "конечно" -> [SemState]
    "конструкции" -> [SemUnknown]
    "конструкция" -> [SemUnknown]
    "конструкциях" -> [SemUnknown]
    "контакт" -> [SemDialogueRepair]
    "контекст" -> [SemUnknown]
    "контекста" -> [SemUnknown]
    "контекстом" -> [SemUnknown]
    "контраст" -> [SemUnknown]
    "короткая" -> [SemState]
    "короткие" -> [SemState]
    "короткий" -> [SemState]
    "коротких" -> [SemUnknown]
    "коротко" -> [SemState]
    "короче" -> [SemState]
    "коррекция" -> [SemUnknown]
    "косвенный" -> [SemState]
    "космос" -> [SemWorldObject]
    "которая" -> [SemState]
    "которые" -> [SemState]
    "который" -> [SemState]
    "кофе" -> [SemState]
    "кошка" -> [SemUnknown]
    "красиво" -> [SemState]
    "красивый" -> [SemState]
    "красный" -> [SemState]
    "краткая" -> [SemState]
    "краткие" -> [SemState]
    "краткий" -> [SemState]
    "краткое" -> [SemState]
    "критические" -> [SemState]
    "критично" -> [SemState]
    "кроме" -> [SemState]
    "кто" -> [SemIdentity]
    "кто-то" -> [SemState]
    "куда" -> [SemUnknown]
    "купи" -> [SemUnknown]
    "купить" -> [SemAction]
    "курить" -> [SemAction]
    "ладно" -> [SemState]
    "лежит" -> [SemUnknown]
    "лексические" -> [SemState]
    "летом" -> [SemUnknown]
    "лисий" -> [SemState]
    "лица" -> [SemUnknown]
    "лицо" -> [SemState]
    "личная" -> [SemState]
    "личные" -> [SemState]
    "лог" -> [SemUnknown]
    "логика" -> [SemMentalObject]
    "лозунг" -> [SemUnknown]
    "локализация" -> [SemUnknown]
    "локальной" -> [SemState]
    "ломает" -> [SemAction]
    "ломают" -> [SemAction]
    "лучше" -> [SemComparison, SemState]
    "люблю" -> [SemAction]
    "любой" -> [SemState]
    "люди" -> [SemUnknown]
    "мало" -> [SemState]
    "мальчик" -> [SemUnknown]
    "мама" -> [SemUnknown]
    "мамин" -> [SemUnknown]
    "маркер" -> [SemUnknown]
    "маркеры" -> [SemUnknown]
    "маркирует" -> [SemAction]
    "машинно-полезные" -> [SemState]
    "междометие" -> [SemState]
    "междометия" -> [SemUnknown]
    "ментальное" -> [SemState]
    "ментальные" -> [SemState]
    "меньше" -> [SemState]
    "меняет" -> [SemAction]
    "меняется" -> [SemAction]
    "меняют" -> [SemAction]
    "места" -> [SemUnknown]
    "место" -> [SemState]
    "местоимение" -> [SemState]
    "местоимений" -> [SemState]
    "местоимения" -> [SemUnknown]
    "местоименное" -> [SemState]
    "метро" -> [SemState]
    "минимальная" -> [SemState]
    "минимальные" -> [SemState]
    "минимальный" -> [SemState]
    "минимум" -> [SemUnknown]
    "мн" -> [SemUnknown]
    "много" -> [SemState]
    "могу" -> [SemAction]
    "могут" -> [SemAction]
    "модальность" -> [SemAction]
    "модальные" -> [SemState]
    "модель" -> [SemUnknown]
    "модификатор" -> [SemUnknown]
    "модификаторы" -> [SemUnknown]
    "модифицирует" -> [SemAction]
    "может" -> [SemAction]
    "можешь" -> [SemAction]
    "можно" -> [SemState]
    "мои" -> [SemUnknown]
    "мой" -> [SemUnknown]
    "молоко" -> [SemState]
    "молчать" -> [SemAction]
    "молчит" -> [SemUnknown]
    "море" -> [SemWorldObject]
    "морфема" -> [SemUnknown]
    "морфологические" -> [SemState]
    "морфологический" -> [SemState]
    "морфологию" -> [SemAction]
    "морфология" -> [SemUnknown]
    "москва" -> [SemUnknown]
    "мочь" -> [SemAction]
    "мы" -> [SemSelfReference]
    "мысль" -> [SemMentalObject]
    "мыть" -> [SemAction]
    "мяу" -> [SemAction]
    "набор" -> [SemUnknown]
    "наверное" -> [SemState]
    "надо" -> [SemState]
    "название" -> [SemState]
    "называет" -> [SemAction]
    "называется" -> [SemAction]
    "назывное" -> [SemState]
    "наивного" -> [SemState]
    "найди" -> [SemUnknown]
    "найти" -> [SemAction]
    "наклонение" -> [SemState]
    "наклонения" -> [SemUnknown]
    "наличие" -> [SemState]
    "налоги" -> [SemUnknown]
    "наоборот" -> [SemUnknown]
    "написал" -> [SemAction]
    "написано" -> [SemState]
    "напиши" -> [SemUnknown]
    "направление" -> [SemState]
    "например" -> [SemUnknown]
    "напрямую" -> [SemAction]
    "наречие" -> [SemState]
    "наречием" -> [SemAction]
    "наречия" -> [SemUnknown]
    "наречиями" -> [SemUnknown]
    "наречные" -> [SemState]
    "наречный" -> [SemState]
    "настоящее" -> [SemState]
    "настоящем" -> [SemAction]
    "наука" -> [SemUnknown]
    "находится" -> [SemUnknown]
    "начал" -> [SemAction]
    "начале" -> [SemState]
    "начало" -> [SemState]
    "начнем" -> [SemAction]
    "небо" -> [SemWorldObject, SemWorldPhenomenon]
    "неверно" -> [SemState]
    "неверный" -> [SemState]
    "неизвестен" -> [SemUnknown]
    "неизменяемость" -> [SemAction]
    "некрасивый" -> [SemState]
    "нельзя" -> [SemUnknown]
    "ненавидеть" -> [SemAction]
    "неоднозначность" -> [SemAction]
    "неопределенность" -> [SemAction]
    "непостоянные" -> [SemState]
    "неправильно" -> [SemState]
    "несклоняемые" -> [SemState]
    "несколько" -> [SemState]
    "несмотря" -> [SemUnknown]
    "несовершенный" -> [SemState]
    "нет" -> [SemAction]
    "ниже" -> [SemState]
    "никакой" -> [SemState]
    "никогда" -> [SemUnknown]
    "никто" -> [SemState]
    "ничего" -> [SemState]
    "ничто" -> [SemState]
    "новая" -> [SemState]
    "новый" -> [SemState]
    "ножницы" -> [SemUnknown]
    "норм" -> [SemUnknown]
    "нормально" -> [SemState]
    "нравится" -> [SemUnknown]
    "ну" -> [SemUnknown]
    "ну-ка" -> [SemUnknown]
    "нужный" -> [SemPurposeFunction, SemQualityProperty]
    "оба" -> [SemUnknown]
    "обвиняемый" -> [SemState]
    "обе" -> [SemState]
    "обещал" -> [SemAction]
    "область" -> [SemAction]
    "обозначает" -> [SemAction]
    "обозначающая" -> [SemState]
    "оборот" -> [SemUnknown]
    "обрабатывать" -> [SemAction]
    "обращение" -> [SemState]
    "обращения" -> [SemUnknown]
    "обстоятельство" -> [SemState]
    "обстоятельством" -> [SemUnknown]
    "обсудить" -> [SemAction, SemDialogueInvitation]
    "обсуждать" -> [SemAction]
    "общая" -> [SemState]
    "общения" -> [SemUnknown]
    "объединить" -> [SemAction]
    "объект" -> [SemUnknown]
    "объектом" -> [SemUnknown]
    "объекты" -> [SemUnknown]
    "объяснения" -> [SemUnknown]
    "объясни" -> [SemUnknown]
    "объяснить" -> [SemAction]
    "обычно" -> [SemState]
    "обычное" -> [SemState]
    "обычный" -> [SemState]
    "обычным" -> [SemUnknown]
    "обязан" -> [SemUnknown]
    "обязательно" -> [SemState]
    "ограничение" -> [SemState]
    "ограничения" -> [SemUnknown]
    "один" -> [SemUnknown]
    "одна" -> [SemUnknown]
    "однако" -> [SemState]
    "одни" -> [SemUnknown]
    "одно" -> [SemState]
    "одновременно" -> [SemState]
    "одного" -> [SemState]
    "одному" -> [SemAction]
    "однородные" -> [SemState]
    "однословно" -> [SemState]
    "однословное" -> [SemState]
    "ожидание" -> [SemState]
    "озеро" -> [SemState]
    "означает" -> [SemAction]
    "означать" -> [SemAction]
    "ой" -> [SemState]
    "оказаться" -> [SemAction, SemState]
    "окна" -> [SemUnknown]
    "окно" -> [SemState]
    "окончания" -> [SemUnknown]
    "омонимии" -> [SemUnknown]
    "омонимия" -> [SemUnknown]
    "он" -> [SemUnknown]
    "она" -> [SemUnknown]
    "они" -> [SemUnknown]
    "оно" -> [SemUnknown]
    "оператор" -> [SemUnknown]
    "описывает" -> [SemAction]
    "описываются" -> [SemUnknown]
    "опоздал" -> [SemAction]
    "определение" -> [SemAbstractConcept, SemKnowledge]
    "определитель" -> [SemUnknown]
    "определяет" -> [SemAction]
    "опять" -> [SemAction]
    "осень" -> [SemWorldPhenomenon]
    "основной" -> [SemState]
    "основные" -> [SemState]
    "особая" -> [SemState]
    "особенно" -> [SemState]
    "особые" -> [SemState]
    "остался" -> [SemAction]
    "ответ" -> [SemAction]
    "ответа" -> [SemUnknown]
    "ответил" -> [SemAction]
    "ответить" -> [SemAction]
    "ответы" -> [SemUnknown]
    "отвечает" -> [SemAction]
    "отвечать" -> [SemAction]
    "отдельно" -> [SemState]
    "отдельного" -> [SemState]
    "отдельные" -> [SemState]
    "отдельный" -> [SemState]
    "отказ" -> [SemUnknown]
    "открой" -> [SemState]
    "открывай" -> [SemUnknown]
    "открыл" -> [SemUnknown]
    "открыта" -> [SemUnknown]
    "открыто" -> [SemState]
    "открыть" -> [SemAction]
    "откуда" -> [SemUnknown]
    "отличается" -> [SemAction]
    "отличать" -> [SemAction]
    "отличие" -> [SemComparison, SemRelation, SemState]
    "отложить" -> [SemAction]
    "относительное" -> [SemState]
    "относится" -> [SemUnknown]
    "отношение" -> [SemState]
    "отношении" -> [SemUnknown]
    "отношений" -> [SemState]
    "отношения" -> [SemUnknown]
    "отождествление" -> [SemState]
    "отправил" -> [SemAction]
    "отправь" -> [SemUnknown]
    "отрицается" -> [SemAction]
    "отрицание" -> [SemState]
    "отрицания" -> [SemUnknown]
    "отрицательная" -> [SemState]
    "отрицательное" -> [SemState]
    "отрицательные" -> [SemState]
    "отрицательный" -> [SemState]
    "отсутствие" -> [SemState]
    "отсутствия" -> [SemUnknown]
    "оттенков" -> [SemUnknown]
    "отца" -> [SemUnknown]
    "отчет" -> [SemAction]
    "оформи" -> [SemUnknown]
    "ох" -> [SemUnknown]
    "оценка" -> [SemUnknown]
    "оценку" -> [SemAction]
    "очень" -> [SemUnknown]
    "ошибка" -> [SemDialogueRepair]
    "ошибки" -> [SemUnknown]
    "ошибся" -> [SemUnknown]
    "падеж" -> [SemUnknown]
    "падежа" -> [SemUnknown]
    "падежам" -> [SemUnknown]
    "падеже" -> [SemState]
    "падежи" -> [SemUnknown]
    "падежное" -> [SemState]
    "падежом" -> [SemUnknown]
    "пальто" -> [SemState]
    "первого" -> [SemState]
    "первый" -> [SemUnknown]
    "переведи" -> [SemUnknown]
    "перепиши" -> [SemUnknown]
    "переспрос" -> [SemUnknown]
    "переформулируй" -> [SemUnknown]
    "переход" -> [SemUnknown]
    "переходность" -> [SemAction]
    "печь" -> [SemAction]
    "писал" -> [SemAction]
    "письмо" -> [SemState]
    "пиши" -> [SemUnknown]
    "пишу" -> [SemAction]
    "план" -> [SemUnknown]
    "плохой" -> [SemState]
    "плюс" -> [SemUnknown]
    "по-русски" -> [SemUnknown]
    "поболтаем" -> [SemAction]
    "побуждение" -> [SemState]
    "поведение" -> [SemState]
    "повелительное" -> [SemState]
    "поводу" -> [SemAction]
    "повтори" -> [SemUnknown]
    "повторяющийся" -> [SemUnknown]
    "повышает" -> [SemAction]
    "повышается" -> [SemAction]
    "поговорить" -> [SemAction, SemDialogueInvitation]
    "пограничные" -> [SemState]
    "подлежащего" -> [SemState]
    "подлежащее" -> [SemState]
    "подлежащим" -> [SemUnknown]
    "подробнее" -> [SemState]
    "подтверждение" -> [SemState]
    "подтип" -> [SemUnknown]
    "подумал" -> [SemAction]
    "подчинительный" -> [SemState]
    "поезд" -> [SemUnknown]
    "пожалуйста" -> [SemUnknown]
    "поздно" -> [SemState]
    "позже" -> [SemState]
    "позиции" -> [SemUnknown]
    "позиция" -> [SemUnknown]
    "пойдем" -> [SemAction]
    "пойду" -> [SemAction]
    "пока" -> [SemUnknown]
    "покажи" -> [SemUnknown]
    "показывай" -> [SemUnknown]
    "полезно" -> [SemState]
    "полезны" -> [SemUnknown]
    "полисемия" -> [SemUnknown]
    "полная" -> [SemState]
    "полное" -> [SemState]
    "полноценный" -> [SemState]
    "положительная" -> [SemState]
    "получает" -> [SemAction]
    "пользователь" -> [SemUnknown]
    "помечать" -> [SemAction]
    "помнить" -> [SemAction]
    "помнишь" -> [SemUnknown]
    "помог" -> [SemUnknown]
    "помогает" -> [SemAction]
    "помоги" -> [SemUnknown]
    "помочь" -> [SemAction]
    "понимания" -> [SemUnknown]
    "понимать" -> [SemAction, SemKnowledge]
    "понимаю" -> [SemAction]
    "понял" -> [SemUnknown]
    "понятно" -> [SemState]
    "пора" -> [SemUnknown]
    "порядковое" -> [SemState]
    "порядковые" -> [SemState]
    "порядок" -> [SemUnknown]
    "после" -> [SemState]
    "посмотрел" -> [SemUnknown]
    "постоянные" -> [SemState]
    "построен" -> [SemUnknown]
    "построили" -> [SemAction]
    "построить" -> [SemAction]
    "потом" -> [SemUnknown]
    "похоже" -> [SemState]
    "почему" -> [SemCause, SemState]
    "почитать" -> [SemAction]
    "почти" -> [SemAction]
    "пошел" -> [SemUnknown]
    "поэтому" -> [SemAction, SemCause]
    "поясни" -> [SemUnknown]
    "прав" -> [SemUnknown]
    "правда" -> [SemAbstractConcept, SemContemplative]
    "правила" -> [SemAction]
    "правило" -> [SemState]
    "правильно" -> [SemState]
    "предикат" -> [SemUnknown]
    "предикате" -> [SemState]
    "предикатив" -> [SemUnknown]
    "предикатом" -> [SemUnknown]
    "предл" -> [SemUnknown]
    "предлог" -> [SemUnknown]
    "предлога" -> [SemUnknown]
    "предлоги" -> [SemUnknown]
    "предложение" -> [SemState]
    "предложении" -> [SemUnknown]
    "предложения" -> [SemUnknown]
    "предложный" -> [SemState]
    "предмет" -> [SemAction]
    "предмета" -> [SemUnknown]
    "предупреждение" -> [SemState]
    "предыдущего" -> [SemState]
    "привет" -> [SemAction]
    "приводит" -> [SemUnknown]
    "приглашение" -> [SemState]
    "придаточного" -> [SemState]
    "придаточное" -> [SemState]
    "придет" -> [SemAction]
    "придумай" -> [SemUnknown]
    "признак" -> [SemUnknown]
    "признака" -> [SemUnknown]
    "признаки" -> [SemUnknown]
    "прийти" -> [SemAction]
    "прикрепляется" -> [SemAction]
    "прилагательного" -> [SemState]
    "прилагательное" -> [SemState]
    "прилагательные" -> [SemState]
    "прилагательным" -> [SemUnknown]
    "пример" -> [SemUnknown]
    "примерно" -> [SemState]
    "примеры" -> [SemUnknown]
    "принадлежность" -> [SemAction]
    "принцип" -> [SemUnknown]
    "притяжательное" -> [SemState]
    "причастие" -> [SemState]
    "причастия" -> [SemUnknown]
    "причастный" -> [SemState]
    "причастных" -> [SemState]
    "причина" -> [SemCause]
    "причинность" -> [SemAction]
    "причины" -> [SemUnknown]
    "пришел" -> [SemUnknown]
    "проблема" -> [SemUnknown]
    "проверил" -> [SemAction]
    "проверить" -> [SemAction]
    "проверка" -> [SemUnknown]
    "проверь" -> [SemUnknown]
    "проверять" -> [SemAction]
    "продолжение" -> [SemState]
    "производные" -> [SemState]
    "производный" -> [SemState]
    "происходит" -> [SemUnknown]
    "просит" -> [SemUnknown]
    "просто" -> [SemState]
    "простой" -> [SemState]
    "пространство" -> [SemState]
    "просьба" -> [SemUnknown]
    "просьбы" -> [SemUnknown]
    "противительный" -> [SemState]
    "противопоставление" -> [SemState]
    "прочитав" -> [SemUnknown]
    "прочитай" -> [SemUnknown]
    "прочитал" -> [SemAction]
    "прочитанная" -> [SemState]
    "прочитанный" -> [SemState]
    "прошедшего" -> [SemState]
    "прошедшее" -> [SemState]
    "проще" -> [SemState]
    "прямо" -> [SemState]
    "пунктуацию" -> [SemAction]
    "пунктуация" -> [SemUnknown]
    "путать" -> [SemAction]
    "путь" -> [SemAction]
    "пушкин" -> [SemUnknown]
    "пяти" -> [SemAction]
    "пять" -> [SemUnknown]
    "работает" -> [SemAction]
    "работать" -> [SemAction]
    "рабочий" -> [SemState]
    "рабочими" -> [SemUnknown]
    "равно" -> [SemState]
    "рад" -> [SemUnknown]
    "рада" -> [SemUnknown]
    "ради" -> [SemUnknown]
    "радость" -> [SemAction]
    "раз" -> [SemUnknown]
    "разбор" -> [SemUnknown]
    "разговорные" -> [SemState]
    "разговорный" -> [SemState]
    "разговору" -> [SemAction]
    "раздалось" -> [SemAction]
    "раздельное" -> [SemState]
    "различать" -> [SemAction]
    "различие" -> [SemState]
    "разные" -> [SemState]
    "разных" -> [SemState]
    "разряд" -> [SemUnknown]
    "разу" -> [SemAction]
    "рамочные" -> [SemState]
    "рано" -> [SemState]
    "раньше" -> [SemState]
    "распознавания" -> [SemUnknown]
    "распознавать" -> [SemAction]
    "расскажи" -> [SemUnknown]
    "реакции" -> [SemUnknown]
    "реакция" -> [SemUnknown]
    "реализации" -> [SemUnknown]
    "ребенок" -> [SemUnknown]
    "редко" -> [SemState]
    "река" -> [SemWorldObject]
    "реки" -> [SemUnknown]
    "рекомендация" -> [SemUnknown]
    "рекомендуемый" -> [SemState]
    "реплик" -> [SemUnknown]
    "реплика" -> [SemUnknown]
    "реплики" -> [SemUnknown]
    "репликой" -> [SemState]
    "референт" -> [SemUnknown]
    "речевой" -> [SemState]
    "речевые" -> [SemState]
    "речи" -> [SemUnknown]
    "решение" -> [SemState]
    "решить" -> [SemAction]
    "ровно" -> [SemState]
    "род" -> [SemUnknown]
    "рода" -> [SemUnknown]
    "родительный" -> [SemState]
    "роли" -> [SemUnknown]
    "роль" -> [SemUnknown]
    "руки" -> [SemUnknown]
    "русская" -> [SemState]
    "русский" -> [SemState]
    "русских" -> [SemUnknown]
    "русского" -> [SemState]
    "русском" -> [SemUnknown]
    "ручкой" -> [SemState]
    "рядом" -> [SemUnknown]
    "сайт" -> [SemUnknown]
    "сам" -> [SemUnknown]
    "самое" -> [SemState]
    "самостоятельная" -> [SemState]
    "самостоятельный" -> [SemState]
    "самый" -> [SemState]
    "сбой" -> [SemDialogueRepair, SemState]
    "сборка" -> [SemUnknown]
    "свет" -> [SemAction]
    "свобода" -> [SemAbstractConcept, SemContemplative]
    "свой" -> [SemState]
    "связан" -> [SemUnknown]
    "связи" -> [SemUnknown]
    "связка" -> [SemUnknown]
    "связочные" -> [SemState]
    "связочный" -> [SemState]
    "связывает" -> [SemAction]
    "связь" -> [SemUnknown]
    "сгенерируй" -> [SemUnknown]
    "сделай" -> [SemUnknown]
    "сделал" -> [SemAction]
    "сделать" -> [SemAction]
    "себе" -> [SemState]
    "себя" -> [SemUnknown]
    "сегодня" -> [SemUnknown]
    "сейчас" -> [SemUnknown]
    "семантика" -> [SemUnknown]
    "семантическая" -> [SemState]
    "семантические" -> [SemState]
    "семантической" -> [SemState]
    "сервер" -> [SemUnknown]
    "сестре" -> [SemState]
    "сигнал" -> [SemAction]
    "силен" -> [SemUnknown]
    "синтаксис" -> [SemUnknown]
    "синтаксическая" -> [SemState]
    "синтаксически" -> [SemUnknown]
    "синтаксические" -> [SemState]
    "синтаксический" -> [SemState]
    "синтаксической" -> [SemState]
    "синтаксическую" -> [SemAction]
    "синхронно" -> [SemState]
    "система" -> [SemUnknown]
    "системе" -> [SemState]
    "системы" -> [SemUnknown]
    "ситуации" -> [SemUnknown]
    "скажи" -> [SemUnknown]
    "скажи-ка" -> [SemUnknown]
    "сказал" -> [SemAction]
    "сказать" -> [SemAction]
    "сказуемого" -> [SemState]
    "сказуемое" -> [SemState]
    "сказуемым" -> [SemUnknown]
    "склонение" -> [SemState]
    "сколько" -> [SemState]
    "скрываться" -> [SemAction]
    "скучно" -> [SemState]
    "слева" -> [SemUnknown]
    "следовательно" -> [SemState]
    "следствие" -> [SemCause, SemState]
    "слитное" -> [SemState]
    "слишком" -> [SemUnknown]
    "слов" -> [SemUnknown]
    "слова" -> [SemUnknown]
    "словам" -> [SemUnknown]
    "словарь" -> [SemUnknown]
    "словно" -> [SemState]
    "слово" -> [SemState]
    "словом" -> [SemUnknown]
    "словоформа" -> [SemUnknown]
    "слову" -> [SemAction]
    "сложного" -> [SemState]
    "слой" -> [SemState]
    "служебная" -> [SemState]
    "служебные" -> [SemState]
    "случаи" -> [SemUnknown]
    "случай" -> [SemUnknown]
    "случилось" -> [SemUnknown]
    "слушай" -> [SemUnknown]
    "слышишь" -> [SemUnknown]
    "смотря" -> [SemUnknown]
    "смысл" -> [SemContemplative, SemMentalObject]
    "смягчение" -> [SemState]
    "сначала" -> [SemAction]
    "снег" -> [SemWorldPhenomenon]
    "снега" -> [SemUnknown]
    "собака" -> [SemUnknown]
    "собирательное" -> [SemState]
    "собственное" -> [SemState]
    "событие" -> [SemState]
    "события" -> [SemUnknown]
    "совершенный" -> [SemState]
    "совсем" -> [SemAction]
    "согласие" -> [SemState]
    "согласиться" -> [SemUnknown]
    "согласно" -> [SemState]
    "согласование" -> [SemState]
    "согласования" -> [SemUnknown]
    "согласуется" -> [SemAction]
    "содержание" -> [SemState]
    "содержит" -> [SemUnknown]
    "соединяет" -> [SemAction]
    "создай" -> [SemUnknown]
    "создать" -> [SemAction]
    "сократи" -> [SemAction]
    "сомневаюсь" -> [SemAction]
    "сомнение" -> [SemState]
    "сон" -> [SemUnknown]
    "сообщение" -> [SemState]
    "составе" -> [SemState]
    "составной" -> [SemState]
    "составные" -> [SemState]
    "составь" -> [SemUnknown]
    "состоит" -> [SemUnknown]
    "состояние" -> [SemState]
    "состояния" -> [SemUnknown]
    "сохранить" -> [SemAction]
    "сохранять" -> [SemAction]
    "социальная" -> [SemState]
    "сочетание" -> [SemState]
    "сочинение" -> [SemState]
    "союз" -> [SemUnknown]
    "союза" -> [SemUnknown]
    "союзное" -> [SemState]
    "союзов" -> [SemUnknown]
    "союзом" -> [SemUnknown]
    "союзы" -> [SemUnknown]
    "спал" -> [SemAction]
    "спасибо" -> [SemState]
    "спать" -> [SemAction]
    "списки" -> [SemUnknown]
    "список" -> [SemUnknown]
    "спит" -> [SemUnknown]
    "спокойно" -> [SemState]
    "спорить" -> [SemAction]
    "способ" -> [SemUnknown]
    "способе" -> [SemState]
    "справа" -> [SemUnknown]
    "спросил" -> [SemAction]
    "спросить" -> [SemAction]
    "ср" -> [SemUnknown]
    "сравнение" -> [SemState]
    "сравнения" -> [SemUnknown]
    "сравни" -> [SemUnknown]
    "сравнительная" -> [SemState]
    "сравнительный" -> [SemState]
    "сразу" -> [SemAction]
    "стал" -> [SemAction]
    "стали" -> [SemAction]
    "становилось" -> [SemUnknown]
    "старший" -> [SemState]
    "старый" -> [SemState]
    "статус" -> [SemUnknown]
    "стать" -> [SemAction]
    "стемнело" -> [SemState]
    "степени" -> [SemUnknown]
    "степень" -> [SemUnknown]
    "сто" -> [SemUnknown]
    "стоит" -> [SemUnknown]
    "стол" -> [SemPhysicalObject, SemWorldObject]
    "столовая" -> [SemState]
    "столько" -> [SemState]
    "стоп" -> [SemUnknown]
    "сторонам" -> [SemUnknown]
    "страдательное" -> [SemState]
    "странно" -> [SemState]
    "страшно" -> [SemState]
    "строительство" -> [SemState]
    "строить" -> [SemAction]
    "строка" -> [SemUnknown]
    "структура" -> [SemUnknown]
    "структуры" -> [SemUnknown]
    "субстантивации" -> [SemUnknown]
    "субстантивацию" -> [SemAction]
    "субстантивация" -> [SemUnknown]
    "субстантивированное" -> [SemState]
    "субъект" -> [SemUnknown]
    "субъектность" -> [SemAbstractConcept, SemContemplative]
    "суффиксы" -> [SemUnknown]
    "существительного" -> [SemState]
    "существительное" -> [SemState]
    "существительные" -> [SemState]
    "существительным" -> [SemUnknown]
    "существительных" -> [SemState]
    "существование" -> [SemState]
    "схема" -> [SemUnknown]
    "считать" -> [SemAction]
    "сюда" -> [SemUnknown]
    "таблица" -> [SemUnknown]
    "таблицу" -> [SemAction]
    "так" -> [SemUnknown]
    "также" -> [SemState]
    "такой" -> [SemIdentity]
    "такси" -> [SemUnknown]
    "там" -> [SemUnknown]
    "твор" -> [SemUnknown]
    "творительный" -> [SemState]
    "тег" -> [SemUnknown]
    "текст" -> [SemUnknown]
    "текста" -> [SemUnknown]
    "телефон" -> [SemUnknown]
    "тем" -> [SemAction]
    "тема" -> [SemUnknown]
    "темнее" -> [SemState]
    "темно" -> [SemState]
    "тему" -> [SemAction]
    "темы" -> [SemUnknown]
    "теперь" -> [SemUnknown]
    "тепло" -> [SemState]
    "тесты" -> [SemUnknown]
    "течение" -> [SemState]
    "тип" -> [SemUnknown]
    "типа" -> [SemUnknown]
    "типичные" -> [SemState]
    "типовые" -> [SemState]
    "типы" -> [SemUnknown]
    "тире" -> [SemState]
    "тихо" -> [SemState]
    "тише" -> [SemState]
    "тишина" -> [SemAbstractConcept, SemContemplative]
    "то" -> [SemState]
    "того" -> [SemState]
    "тоже" -> [SemState]
    "токен" -> [SemUnknown]
    "токена" -> [SemUnknown]
    "токены" -> [SemUnknown]
    "тот" -> [SemUnknown]
    "требование" -> [SemState]
    "требует" -> [SemAction]
    "требуют" -> [SemAction]
    "три" -> [SemUnknown]
    "трудно" -> [SemState]
    "туда" -> [SemUnknown]
    "тут" -> [SemAction]
    "ты" -> [SemUserReference]
    "уверен" -> [SemUnknown]
    "уверенно" -> [SemState]
    "уверенность" -> [SemAction]
    "увы" -> [SemUnknown]
    "удали" -> [SemAction]
    "удалить" -> [SemAction]
    "удаляй" -> [SemUnknown]
    "удивительно" -> [SemState]
    "уж" -> [SemUnknown]
    "уже" -> [SemState]
    "узкий" -> [SemState]
    "уйти" -> [SemAction]
    "указание" -> [SemState]
    "указательное" -> [SemState]
    "указывает" -> [SemAction]
    "улице" -> [SemState]
    "улучши" -> [SemUnknown]
    "улыбаться" -> [SemUnknown]
    "улыбаясь" -> [SemUnknown]
    "упала" -> [SemAction]
    "употребление" -> [SemState]
    "управление" -> [SemState]
    "ура" -> [SemUnknown]
    "уровне" -> [SemState]
    "урока" -> [SemUnknown]
    "усиление" -> [SemState]
    "усиления" -> [SemUnknown]
    "усиливает" -> [SemAction]
    "усилитель" -> [SemUnknown]
    "усилительная" -> [SemState]
    "усилительное" -> [SemState]
    "условие" -> [SemState]
    "условии" -> [SemUnknown]
    "условного" -> [SemState]
    "условное" -> [SemState]
    "условном" -> [SemUnknown]
    "устал" -> [SemAction]
    "устойчивые" -> [SemState]
    "уточнение" -> [SemState]
    "уточнить" -> [SemAction]
    "уточняющий" -> [SemState]
    "утром" -> [SemUnknown]
    "участник" -> [SemUnknown]
    "участников" -> [SemUnknown]
    "учащийся" -> [SemUnknown]
    "учитель" -> [SemUnknown]
    "учителя" -> [SemUnknown]
    "учитывать" -> [SemAction]
    "учреждение" -> [SemState]
    "ушел" -> [SemUnknown]
    "ушли" -> [SemUnknown]
    "файл" -> [SemUnknown]
    "фильм" -> [SemUnknown]
    "фокус" -> [SemUnknown]
    "форм" -> [SemUnknown]
    "форма" -> [SemUnknown]
    "формат" -> [SemUnknown]
    "форме" -> [SemState]
    "формой" -> [SemState]
    "формообразующая" -> [SemState]
    "форму" -> [SemAction]
    "формулы" -> [SemUnknown]
    "формы" -> [SemUnknown]
    "фотосинтез" -> [SemUnknown]
    "фрагмент" -> [SemUnknown]
    "фрагменты" -> [SemUnknown]
    "фу" -> [SemAction]
    "функция" -> [SemPurposeFunction]
    "хватит" -> [SemUnknown]
    "хлеб" -> [SemUnknown]
    "холодно" -> [SemState]
    "хороший" -> [SemState]
    "хорошо" -> [SemState]
    "хотел" -> [SemUnknown]
    "хотеть" -> [SemAction]
    "хочу" -> [SemAction]
    "хранить" -> [SemAction]
    "хуже" -> [SemComparison, SemState]
    "цели" -> [SemUnknown]
    "цель" -> [SemPurposeFunction]
    "целью" -> [SemAction]
    "центр" -> [SemUnknown]
    "чай" -> [SemUnknown]
    "час" -> [SemUnknown]
    "частей" -> [SemUnknown]
    "части" -> [SemAction]
    "частица" -> [SemUnknown]
    "частицу" -> [SemAction]
    "частицы" -> [SemUnknown]
    "частично" -> [SemState]
    "часто" -> [SemState]
    "часть" -> [SemAction]
    "чате" -> [SemState]
    "чаще" -> [SemState]
    "че" -> [SemState]
    "чей" -> [SemUnknown]
    "человек" -> [SemUnknown]
    "четыре" -> [SemUnknown]
    "числа" -> [SemUnknown]
    "числительного" -> [SemState]
    "числительное" -> [SemState]
    "числительные" -> [SemState]
    "число" -> [SemState]
    "читает" -> [SemAction]
    "читать" -> [SemAction]
    "читаю" -> [SemAction]
    "читающий" -> [SemState]
    "читая" -> [SemState]
    "член" -> [SemUnknown]
    "членами" -> [SemUnknown]
    "членом" -> [SemUnknown]
    "члены" -> [SemUnknown]
    "чтение" -> [SemState]
    "что" -> [SemIdentity]
    "что-нибудь" -> [SemUnknown]
    "что-то" -> [SemState]
    "шел" -> [SemUnknown]
    "школа" -> [SemUnknown]
    "школу" -> [SemAction]
    "школьная" -> [SemState]
    "школьного" -> [SemState]
    "школьной" -> [SemState]
    "школьный" -> [SemState]
    "шум" -> [SemUnknown]
    "эвристики" -> [SemUnknown]
    "эй" -> [SemUnknown]
    "экспрессия" -> [SemUnknown]
    "элемент" -> [SemUnknown]
    "эллипсис" -> [SemUnknown]
    "эмоциональная" -> [SemState]
    "эта" -> [SemUnknown]
    "этикетные" -> [SemState]
    "это" -> [SemUnknown]
    "этот" -> [SemUnknown]
    "эту" -> [SemAction]
    "эх" -> [SemUnknown]
    "я" -> [SemSelfReference]
    "явление" -> [SemAbstractConcept]
    "являться" -> [SemIdentity, SemState]
    "явно" -> [SemState]
    "явного" -> [SemState]
    "ядра" -> [SemUnknown]
    "ядро" -> [SemState]
    _ -> []
